[{
    "entity": "Intention",
    "sentences": ["Termination, Suspension, Reactivation, Change and Transfer of Service\nSuspension or Termination\nWe can decide to either suspend or terminate the Service without warning, or issue a warning including for network or system maintenance, improvement, or failure or if we suspect your Service is being used for any unauthorized or inappropriate purpose, as a result of your breach of these Terms & Conditions or for reasons unrelated to you or your account with us.", "You may not (and may not permit or cause any other party to) sell or resell or otherwise use the Service or any information provided through the Service for commercial purposes, nor may you reproduce, copy, modify, attempt to reverse engineer, make derivative works from or otherwise display or distribute information provided through the Service.", "You may use the attached model revocation form for this purpose, but this is not mandatory.", "Supercharger Fair Use\n\nTo help ensure that Superchargers are available for their intended use, unless you charge on a pay per use basis, we ask that you not charge your vehicle using a Supercharger if your vehicle is being used:\n\nas a taxi;\nfor ridesourcing or ridesharing (through Uber, Lyft or similar services);\nto commercially deliver or transport goods;\nfor government purposes; or\nfor any other commercial venture.", "We may also take additional action to protect the availability of Superchargers for their intended purpose, such as limiting or blocking your vehicle’s ability to use Supercharger stations.", "Tesla shall be liable without limitation under the Agreement for damages resulting from intentional or negligent injury to life, body or health and for other damages resulting from intentional or grossly negligent conduct by Tesla or its legal representatives or agents."]
}, {
    "entity": "Supercharged",
    "sentences": ["Tesla, Inc\nAttn: Legal,\n45500 Fremont Boulevard\nFremont, CA 94538\n(650) 681-5000\n\nTerms of Use\n\nPayment Terms for Services\nPremium Connectivity\nRevocation Policy\nSupercharger Fair Use Policy\nTesla Intellectual Property\nPayment Terms for Services\n\nThese Terms of Service describe your agreement to pay for future services and charges.", "Idle Fee\n\nIn consideration of others who need to use a Supercharger, we ask that you move your vehicle when it is finished charging.", "To avoid idle fees, we recommend you monitor your vehicle while using a Supercharger and encourage you to use the Tesla mobile app to track your vehicle's charge status.", "For additional information, please see our Supercharger support page.", "To Tesla Motors Limited, 197 Horton Road, West Drayton UB7 8JD, United Kingdom:\nHereby I/we (*) revoke the contract concluded by me/us (*) for the purchase of the following goods (*)/the provision of the following service (*)\nOrdered on (*)/received on (*) -Name of consumer(s)\nAddress of the consumer(s)\nSignature of the consumer(s) (only in the case of paper notification)\n(*) Delete as appropriate\n\n \n\nSupercharger Fair Use Policy\n\nIntroduction\n\nWe are continually expanding our global network of Supercharger stations to enable personal long distance travel and to provide a charging solution for those without immediate access to home or workplace charging, thereby accelerating the widespread adoption of electric vehicles.", "Supercharger Fair Use\n\nTo help ensure that Superchargers are available for their intended use, unless you charge on a pay per use basis, we ask that you not charge your vehicle using a Supercharger if your vehicle is being used:\n\nas a taxi;\nfor ridesourcing or ridesharing (through Uber, Lyft or similar services);\nto commercially deliver or transport goods;\nfor government purposes; or\nfor any other commercial venture.", "If you charge your vehicle in a manner that does not comply with this Supercharger Fair Use Policy, we may ask you to modify this behavior.", "We may also take additional action to protect the availability of Superchargers for their intended purpose, such as limiting or blocking your vehicle’s ability to use Supercharger stations.", "Tesla may choose to exclude certain Supercharger stations or occasional trips from the scope of this Policy, such as to accommodate specific local circumstances.", "Until Tesla can confirm that the vehicle is in compliance with Tesla’s safety standards and vehicle specifications, Tesla does not perform or support repairs involving the HV (high-voltage) battery systems in the vehicle because of the potential for the salvage vehicle to have sustained damage that:\n\nMakes the vehicle unsafe to drive\nMakes the vehicle unsafe for any repair technicians that might work on the vehicle\nMight damage Tesla equipment, such as Superchargers\nWhen a vehicle is classified as a salvaged vehicle:\n\nAny Tesla limited warranties and extended service agreements for the vehicle are void.", "Credits for Supercharging expire after a set period of time and do not rollover into future periods."]
}, {
    "entity": "Belief",
    "sentences": ["The words \"anticipate\", \"assume\", \"believe\", \"estimate\", \"expect\", \"intend\", \"may\", \"plan\", \"project\" and \"should\" and similar expressions identify forward-looking statements.", "Supplier Compliance\n\nTesla will do the following to ensure compliance by its suppliers with this policy as required by law and as needed:\n\nEvaluate its supply chain to address risks related to conflict minerals, human trafficking, slavery and child labor;\nAudit suppliers, to evaluate supplier compliance with Tesla's Human Rights and Conflict Minerals Policy;\nRequire direct suppliers to certify that materials incorporated into Tesla products comply with the laws regarding conflict minerals, slavery, child labor and human trafficking of the country or countries in which they are doing business;\nDiscipline employees or contractors, including potential termination of contract, who fail to meet Tesla's Human Rights and Conflict Minerals Policy;\nTrain certain Tesla employees regarding conflict minerals, human trafficking, child labor and slavery, particularly with respect to mitigating risks within the Tesla's supply chain;\nInvestigate if Tesla has a reasonable basis to believe that a Tesla supplier is engaging in human trafficking, slave or child labor, or use of conflict minerals; and\nTransition away from purchasing goods or services from any supplier that is believed to be engaging in human trafficking, slave or child labor, or use of conflict minerals if the supplier does not take corrective actions within a reasonable period of time."]
}, {
    "entity": "Credit card",
    "sentences": ["Tesla may collect payment from you, including by using the credit card saved in your Tesla Account.", "For information on how we handle your credit card information, please see our Privacy Policy.", "Your Agreement to Pay\nYou are responsible for paying all amounts due on time and in full and to keep an active credit card on file with us.", "We will automatically debit your monthly payment from this credit card on the monthly anniversary of the effective date of this Agreement unless you cancel your Service before the applicable day of renewal.", "Credits for Supercharging expire after a set period of time and do not rollover into future periods.", "We may terminate or suspend your Service without notice to you, if your credit, charge or debit card provider refuses a charge from us or if such card has otherwise expired.", "If we elect to terminate your Service, you will be entitled to a pro rata refund or credit of the prepaid charges determined on the remaining monthly term of the Service."]
}, {
    "entity": "Mobile network operator",
    "sentences": ["In the event of any regulatory, governmental or other legally-compelled changes, or discontinuation or change of necessary telecommunications systems and services (e.g., if our Wireless Service Provider terminates or restricts wireless services of the type used by your Vehicle’s equipment), you are solely responsible for replacing, as well as the cost of replacing, any equipment that is necessitated as a result of such change or discontinuation, except that if such change occurs during your Vehicle’s base warranty period, while you will still be responsible for the cost of such replacement, we will be responsible for obtaining and providing you with the necessary replacement materials (if applicable)."]
}, {
    "entity": "Vehicle",
    "sentences": ["Information We May Collect\nWe collect three main types of information related to you or your use of our products and services: \n\n(1) Information from or about you or your devices \n(2) Information from or about your Tesla vehicle \n(3) Information from or about your Tesla energy products \n\nDepending on the Tesla products and services you request, own, or use, not all of these types of information may be applicable.", "How We May Use Your Information\nWe may use information we collect to: \n\n(1) Communicate with you \n(2) Fulfill our products and services \n(3) Improve and enhance development of our products and services \n\nThis includes contacting you (or other necessary parties) to advise you of important safety-related information, to notify first responders in the event of an accident involving your vehicle, present products and offers tailored to you, or to respond to your inquiries and fulfill your requests for product information, newsletters, or other events.", "Choice and Transparency\nWe enable you to access and control the data that we collect, use and share from or about you, or your use of our products or services, including through device permissions, in-app settings, marketing opt-outs, and disabling collection of certain vehicle data.", "The services or charges described below may result in charges to you, even if someone else is using your vehicle.", "If you do not pay past due amounts we may limit or block your vehicle's ability to use the related services until payment issues are resolved.", "Idle Fee\n\nIn consideration of others who need to use a Supercharger, we ask that you move your vehicle when it is finished charging.", "All vehicles are subject to idle fees, regardless of when your vehicle was purchased.", "To avoid idle fees, we recommend you monitor your vehicle while using a Supercharger and encourage you to use the Tesla mobile app to track your vehicle's charge status.", "The idle fee rate for each location may change from time to time, and the latest information is provided in the map pin pop-up (accessible through the navigation application on your vehicle touchscreen).", "The pay per use billing unit and rate for each location may change from time to time, and the latest information is provided in the map pin pop-up (accessible through the navigation application on your vehicle touchscreen).", "You must notify us if you sell or transfer your Vehicle or end its lease.", "If you fail to notify us, you will remain responsible for all charges for any Service incurred in connection with such Vehicle.", "It is your responsibility to remove all data and content (including any personal information), if any, that you may have stored on your system before you sell or transfer your Vehicle.", "Your Responsibility for Maintaining Your Vehicle\nIn order for us to provide the Service, your Vehicle must be in good working order and your Vehicle must have a working electrical system and adequate battery power.", "The Service may not work if you try to modify or add any equipment or software in or to your Vehicle that is not expressly authorized by us or is not compatible with the Service.", "Some examples are atmospheric, geographic, or topographic conditions (such as tall buildings, hills or tunnels), damage to or failure to maintain your Vehicle or the equipment in good working order, government laws, rules or regulations, failure, congestion or outages of utility or wireless networks (including interruption of cellular service), war, act of God, natural disaster, inclement weather, and labor strikes.", "In the event of any regulatory, governmental or other legally-compelled changes, or discontinuation or change of necessary telecommunications systems and services (e.g., if our Wireless Service Provider terminates or restricts wireless services of the type used by your Vehicle’s equipment), you are solely responsible for replacing, as well as the cost of replacing, any equipment that is necessitated as a result of such change or discontinuation, except that if such change occurs during your Vehicle’s base warranty period, while you will still be responsible for the cost of such replacement, we will be responsible for obtaining and providing you with the necessary replacement materials (if applicable).", "We may update or modify the software contained in your Vehicle from time to time, and we may do this remotely without notifying you or seeking your consent.", "These software updates and modifications may affect or erase data that you have previously stored on the equipment in your Vehicle (such as specific route or destination information).", "You understand that software available is dependent on vehicle configuration and geographical region, which may affect your access to the Service and/or any of its features.", "Additional Terms\nGoverning Law\nThe terms of this Agreement are governed by, and to be interpreted according to, the laws of the country in which we are licensed to sell motor vehicles that is nearest to your address that you input onto our website when placing this order.", "To Tesla Motors Limited, 197 Horton Road, West Drayton UB7 8JD, United Kingdom:\nHereby I/we (*) revoke the contract concluded by me/us (*) for the purchase of the following goods (*)/the provision of the following service (*)\nOrdered on (*)/received on (*) -Name of consumer(s)\nAddress of the consumer(s)\nSignature of the consumer(s) (only in the case of paper notification)\n(*) Delete as appropriate\n\n \n\nSupercharger Fair Use Policy\n\nIntroduction\n\nWe are continually expanding our global network of Supercharger stations to enable personal long distance travel and to provide a charging solution for those without immediate access to home or workplace charging, thereby accelerating the widespread adoption of electric vehicles.", "Supercharger Fair Use\n\nTo help ensure that Superchargers are available for their intended use, unless you charge on a pay per use basis, we ask that you not charge your vehicle using a Supercharger if your vehicle is being used:\n\nas a taxi;\nfor ridesourcing or ridesharing (through Uber, Lyft or similar services);\nto commercially deliver or transport goods;\nfor government purposes; or\nfor any other commercial venture.", "If you charge your vehicle in a manner that does not comply with this Supercharger Fair Use Policy, we may ask you to modify this behavior.", "We may also take additional action to protect the availability of Superchargers for their intended purpose, such as limiting or blocking your vehicle’s ability to use Supercharger stations.", "Please reach out to your local sales contact to explore vehicle and charging options that suit your needs.", "Such statements are subject to risks and uncertainties, including, but not limited to: changes in currency exchange rates, interest rates and in raw material prices; introduction of competing products; increased sales incentives; and decline in resale prices of used vehicles.", "Tesla was created to accelerate the advent of sustainable transport, and this policy is intended to encourage the advancement of a common, rapidly-evolving platform for electric vehicles, thereby benefiting Tesla, other companies making electric vehicles, and the world.", "Tesla’s Pledge\n\nTesla irrevocably pledges that it will not initiate a lawsuit against any party for infringing a Tesla Patent through activity relating to electric vehicles or related equipment for so long as such party is acting in good faith.", "A party is \"acting in good faith\" for so long as such party and its related or affiliated companies have not:\n\nasserted, helped others assert or had a financial stake in any assertion of (i) any patent or other intellectual property right against Tesla or (ii) any patent right against a third party for its use of technologies relating to electric vehicles or related equipment;\nchallenged, helped others challenge, or had a financial stake in any challenge to any Tesla patent; or\nmarketed or sold any knock-off product (e.g., a product created by imitating or copying the design or appearance of a Tesla product or which suggests an association with or endorsement by Tesla) or provided any material assistance to another party doing so.", "What this pledge means is that as long as someone uses our patents for electric vehicles and doesn’t do bad things, such as knocking off our products or using our patents and then suing us for intellectual property infringement, they should have no fear of Tesla asserting its patents against them.", "Tesla Conflict Minerals Report\n\nDownload PDF\n\nLast Updated May 2020\n\nTesla Supplier Code of Conduct\n\nDownload PDF\n\nLast Updated June 2017\n\nTesla UK Modern Slavery Act Transparency Statement\n\nDownload 2019 Report PDF\n\nLast Updated June 2020\n\nDownload 2018 Report PDF\n\nDownload 2017 Report PDF\n\nDownload 2016 Report PDF\n\nUnsupported or Salvaged Vehicle Policy\n\nAn unsupported or salvaged vehicle is a vehicle that has been declared a total loss, commonly after extensive damage caused by a crash, flooding, fire, or similar hazard, and has been (or qualifies to be) registered and/or titled by its owner as a salvaged vehicle or its equivalent pursuant to local jurisdiction or industry practice.", "Salvage registration/titling typically can never be removed from the vehicle so that all future persons understand the condition and value of the vehicle.", "Tesla does not warrant the safety or operability of salvaged vehicles.", "Repairs performed to bring a salvaged vehicle back into service may not meet Tesla standards or specifications and that is why the vehicle is unsupported.", "Until Tesla can confirm that the vehicle is in compliance with Tesla’s safety standards and vehicle specifications, Tesla does not perform or support repairs involving the HV (high-voltage) battery systems in the vehicle because of the potential for the salvage vehicle to have sustained damage that:\n\nMakes the vehicle unsafe to drive\nMakes the vehicle unsafe for any repair technicians that might work on the vehicle\nMight damage Tesla equipment, such as Superchargers\nWhen a vehicle is classified as a salvaged vehicle:\n\nAny Tesla limited warranties and extended service agreements for the vehicle are void.", "NOTE: Repairs due to recalls will be performed unless the safe repair of the vehicle is prevented either by the condition of the vehicle or by vehicle modifications not installed by Tesla.", "If the Tesla Service Center determines that the vehicle is not safe to repair, the recall-related repair will not be performed until the customer has returned the vehicle to a condition that the Service Center determines is safe to repair.", "Any Unrestricted or Over-the-Counter part may be purchased for a salvage-titled vehicle.", "A “Salvage-Titled Vehicle HV Safety Inspection” may be performed (at the customer’s expense) on the vehicle to determine if the HV-related components are safe to work on or access."]
}, {
    "entity": "Warranty",
    "sentences": ["In the event of any regulatory, governmental or other legally-compelled changes, or discontinuation or change of necessary telecommunications systems and services (e.g., if our Wireless Service Provider terminates or restricts wireless services of the type used by your Vehicle’s equipment), you are solely responsible for replacing, as well as the cost of replacing, any equipment that is necessitated as a result of such change or discontinuation, except that if such change occurs during your Vehicle’s base warranty period, while you will still be responsible for the cost of such replacement, we will be responsible for obtaining and providing you with the necessary replacement materials (if applicable).", "Such warranty does not cover the Service, in whole or in part.", "Disclaimer of Warranties\nTESLA DOES NOT WARRANT OR GUARANTEE THAT SERVICE WILL BE AVAILABLE AT ANY SPECIFIC TIME OR AT ALL TIMES OR TO ANY GEOGRAPHIC LOCATION, OR THAT THE SERVICE WILL BE PROVIDED WITHOUT INTERRUPTION, DELAY OR ERROR.", "We are not responsible for any statements, agreements, representations, warranties or covenants, oral or written, including, without limitation, any statements from third parties, concerning or relating to the Service provided to you pursuant to these Terms & Conditions, unless such statements, agreements, representations warranties or covenants are expressly contained in or incorporate by these Terms & Conditions.", "Until Tesla can confirm that the vehicle is in compliance with Tesla’s safety standards and vehicle specifications, Tesla does not perform or support repairs involving the HV (high-voltage) battery systems in the vehicle because of the potential for the salvage vehicle to have sustained damage that:\n\nMakes the vehicle unsafe to drive\nMakes the vehicle unsafe for any repair technicians that might work on the vehicle\nMight damage Tesla equipment, such as Superchargers\nWhen a vehicle is classified as a salvaged vehicle:\n\nAny Tesla limited warranties and extended service agreements for the vehicle are void."]
}, {
    "entity": "Tesla Motors",
    "sentences": ["Information We May Collect\nWe collect three main types of information related to you or your use of our products and services: \n\n(1) Information from or about you or your devices \n(2) Information from or about your Tesla vehicle \n(3) Information from or about your Tesla energy products \n\nDepending on the Tesla products and services you request, own, or use, not all of these types of information may be applicable.", "Tesla Updates may be tailored to your needs and interests that we may infer from your interaction with us.", "You can withdraw your consent to receive commercial electronic messages at any time by clicking \"unsubscribe\" at the bottom of these emails or Tesla app message, or letting our customer representative know about your decision.", "Some messages directly related to a Tesla purchase cannot be opted out of.", "Tesla, Inc\nAttn: Legal,\n45500 Fremont Boulevard\nFremont, CA 94538\n(650) 681-5000\n\nTerms of Use\n\nPayment Terms for Services\nPremium Connectivity\nRevocation Policy\nSupercharger Fair Use Policy\nTesla Intellectual Property\nPayment Terms for Services\n\nThese Terms of Service describe your agreement to pay for future services and charges.", "Tesla may amend these terms and any changes are effective when posted to this page.", "Tesla may collect payment from you, including by using the credit card saved in your Tesla Account.", "You will be able to review a summary of transactions in your Tesla Account.", "To avoid idle fees, we recommend you monitor your vehicle while using a Supercharger and encourage you to use the Tesla mobile app to track your vehicle's charge status.", "We will notify you of such change by posting the amended terms on our website and/or on your Tesla Account.", "Cancellation by You\nYou may cancel the Service at any time through your Tesla Account or by contacting our Customer Support team and notifying us that you want to cancel the Service.", "Disclaimer of Warranties\nTESLA DOES NOT WARRANT OR GUARANTEE THAT SERVICE WILL BE AVAILABLE AT ANY SPECIFIC TIME OR AT ALL TIMES OR TO ANY GEOGRAPHIC LOCATION, OR THAT THE SERVICE WILL BE PROVIDED WITHOUT INTERRUPTION, DELAY OR ERROR.", "In addition, neither we, any Tesla entity nor our service partners are liable (1) for our inability to contact any service partner or other party in any particular situation (including any emergency personnel), (2) for any act or omission of any other company furnishing a part of our Service or any equipment provided for such Service, (3) for errors or omissions of any vendors, dealers or manufacturers participating in offers made through us, or (4) for any damages that result from or arise out of the use, installation, repair or maintenance by you (or by any person you authorize) of the Service, or any product or service provided by or manufactured by third parties.", "Tesla shall be liable without limitation under the Agreement for damages resulting from intentional or negligent injury to life, body or health and for other damages resulting from intentional or grossly negligent conduct by Tesla or its legal representatives or agents.", "Unless Tesla has unlimited liability under the provisions of the previous paragraph, in case of a breach of a material contractual obligation due to ordinary negligence, Tesla's liability for damages or reimbursement of expenses shall be limited to typically foreseeable damages.", "In order to exercise your right of revocation, you must inform us (Tesla Motors Limited, 197 Horton Road, West Drayton UB7 8JD, United Kingdom) by means of a clear statement (e.g.", "To Tesla Motors Limited, 197 Horton Road, West Drayton UB7 8JD, United Kingdom:\nHereby I/we (*) revoke the contract concluded by me/us (*) for the purchase of the following goods (*)/the provision of the following service (*)\nOrdered on (*)/received on (*) -Name of consumer(s)\nAddress of the consumer(s)\nSignature of the consumer(s) (only in the case of paper notification)\n(*) Delete as appropriate\n\n \n\nSupercharger Fair Use Policy\n\nIntroduction\n\nWe are continually expanding our global network of Supercharger stations to enable personal long distance travel and to provide a charging solution for those without immediate access to home or workplace charging, thereby accelerating the widespread adoption of electric vehicles.", "Tesla may choose to exclude certain Supercharger stations or occasional trips from the scope of this Policy, such as to accommodate specific local circumstances.", "For questions related to home charging, please contact charginginstallation@tesla.com.", "No Licenses\n\nTesla, Inc. strives to achieve innovative and informative internet sites.", "Tesla, Inc. hopes that you will be as enthusiastic as we are about this creative effort.", "However, Tesla, Inc. must protect its intellectual property, including its patents, trademarks and copyrights.", "Accordingly, please be on notice that neither these internet sites, nor any material contained therein shall in any way grant or be taken to grant any person a license to Tesla, Inc.'s intellectual property.", "Policy\n\nHuman Rights And Conflict Minerals Policy\n\nTesla expects our suppliers to conduct their worldwide operations in responsible manner in adherence of this policy and the principles enumerated herein.", "Tesla works collaboratively with our suppliers to encourage compliance with the following principles:\n\nLegal And Regulatory Compliance\n\nTesla suppliers are to ensure their operations and the products and services supplied to Tesla comply with all national and other applicable laws and regulations.", "Conflict Minerals\n\nTesla's suppliers are expected to use reasonable efforts to ensure that parts and products supplied to Tesla are DRC \"conflict-free,\" meaning that such conflict minerals do not benefit armed groups in the Democratic Republic of the Congo.", "The goal of this policy is to ensure that Tesla's products do not directly or indirectly finance or benefit armed groups through mining or mineral trading in the DRC and adjoining countries.", "Tesla requires its suppliers to establish policies, due diligence frameworks, and management systems, consistent with the OECD Due Diligence Guidance for Responsible Supply Chains of Minerals from Conflict-Affected and High-Risk Areas, that are designed to accomplish this goal.", "Tesla expects its suppliers to stay up-to-date with and to use validated conflict free smelters and refiners assessed by the Responsible Mineral Initiative and similar organizations.", "Human Rights\n\nTesla is committed to ensuring that its suppliers do not use slave or child labor or engage in human trafficking.", "Tesla does not, and will not, tolerate the use of slave or child labor in the manufacture of its products and does not, and will not, accept products or services from suppliers that engage in human trafficking in any form.", "Supplier Compliance\n\nTesla will do the following to ensure compliance by its suppliers with this policy as required by law and as needed:\n\nEvaluate its supply chain to address risks related to conflict minerals, human trafficking, slavery and child labor;\nAudit suppliers, to evaluate supplier compliance with Tesla's Human Rights and Conflict Minerals Policy;\nRequire direct suppliers to certify that materials incorporated into Tesla products comply with the laws regarding conflict minerals, slavery, child labor and human trafficking of the country or countries in which they are doing business;\nDiscipline employees or contractors, including potential termination of contract, who fail to meet Tesla's Human Rights and Conflict Minerals Policy;\nTrain certain Tesla employees regarding conflict minerals, human trafficking, child labor and slavery, particularly with respect to mitigating risks within the Tesla's supply chain;\nInvestigate if Tesla has a reasonable basis to believe that a Tesla supplier is engaging in human trafficking, slave or child labor, or use of conflict minerals; and\nTransition away from purchasing goods or services from any supplier that is believed to be engaging in human trafficking, slave or child labor, or use of conflict minerals if the supplier does not take corrective actions within a reasonable period of time.", "Grievance Mechanism\n\nYou may contact Tesla's Board of Directors to provide comments or to report concerns.", "You may also provide comments or report concerns by email to: legal@tesla.com.", "https://os.tesla.com/parrot-sources/parrot-sources.tar.gz\n\nAdditional packages:\n\nFor Autopilot and Infotainment system image sources, see:\nhttp://github.com/teslamotors/buildroot\n\nMain branch is buildroot-2019.02\nSee README.Tesla for more information on contents and configurations\nFor Autopilot and Infotainment kernel sources, see:\nhttp://github.com/teslamotors/linux\n\nbranches:\nintel-4.1: Infotainment Intel kernel\ntegra-2.6: Infotainment Tegra kernel\ntegra-4.4: Infotainment Tegra kernel\ntesla-3.18-hw2: Autopilot Nvidia kernel\ntesla-3.18-hw25: Autopilot Nvidia kernel\ntesla-4.14-hw3: Autopilot Tesla kernel\nFor Autopilot coreboot sources, see:\nhttp://github.com/teslamotors/coreboot\n\ntesla-4.6-hw3\nForthcoming releases and estimated timelines:\n\nHarman Radio module for Model 3\nPass-through source drop: Q3 2018\nCellular modem modules for Model S/X/3\nPass-through source drops: Q3 2018\nPatent Pledge\n\nOn June 12, 2014, Tesla announced that it will not initiate patent lawsuits against anyone who, in good faith, wants to use its technology.", "Tesla was created to accelerate the advent of sustainable transport, and this policy is intended to encourage the advancement of a common, rapidly-evolving platform for electric vehicles, thereby benefiting Tesla, other companies making electric vehicles, and the world.", "Tesla’s Pledge\n\nTesla irrevocably pledges that it will not initiate a lawsuit against any party for infringing a Tesla Patent through activity relating to electric vehicles or related equipment for so long as such party is acting in good faith.", "A list of Tesla Patents subject to the Pledge will be maintained at the following URL: https://www.tesla.com/about/legal#patent-list.", "A party is \"acting in good faith\" for so long as such party and its related or affiliated companies have not:\n\nasserted, helped others assert or had a financial stake in any assertion of (i) any patent or other intellectual property right against Tesla or (ii) any patent right against a third party for its use of technologies relating to electric vehicles or related equipment;\nchallenged, helped others challenge, or had a financial stake in any challenge to any Tesla patent; or\nmarketed or sold any knock-off product (e.g., a product created by imitating or copying the design or appearance of a Tesla product or which suggests an association with or endorsement by Tesla) or provided any material assistance to another party doing so.", "Transfer of Tesla Patents\n\nShould Tesla ever transfer a Tesla Patent to a third party, it will do so only to a party that agrees, by means of a public declaration intended to be binding on such party, to provide the same protection that Tesla provided under the Pledge and to place the same requirement on any subsequent transferee.", "In order for Tesla to preserve its ability to enforce the Tesla Patents against any party not acting in good faith, the Pledge is not a waiver of any patent claims (including claims for damages for past acts of infringement) and is not a license, covenant not to sue, or authorization to engage in patented activities or a limitation on remedies, damages or claims.", "What this pledge means is that as long as someone uses our patents for electric vehicles and doesn’t do bad things, such as knocking off our products or using our patents and then suing us for intellectual property infringement, they should have no fear of Tesla asserting its patents against them.", "Tesla Conflict Minerals Report\n\nDownload PDF\n\nLast Updated May 2020\n\nTesla Supplier Code of Conduct\n\nDownload PDF\n\nLast Updated June 2017\n\nTesla UK Modern Slavery Act Transparency Statement\n\nDownload 2019 Report PDF\n\nLast Updated June 2020\n\nDownload 2018 Report PDF\n\nDownload 2017 Report PDF\n\nDownload 2016 Report PDF\n\nUnsupported or Salvaged Vehicle Policy\n\nAn unsupported or salvaged vehicle is a vehicle that has been declared a total loss, commonly after extensive damage caused by a crash, flooding, fire, or similar hazard, and has been (or qualifies to be) registered and/or titled by its owner as a salvaged vehicle or its equivalent pursuant to local jurisdiction or industry practice.", "Tesla does not warrant the safety or operability of salvaged vehicles.", "Repairs performed to bring a salvaged vehicle back into service may not meet Tesla standards or specifications and that is why the vehicle is unsupported.", "Until Tesla can confirm that the vehicle is in compliance with Tesla’s safety standards and vehicle specifications, Tesla does not perform or support repairs involving the HV (high-voltage) battery systems in the vehicle because of the potential for the salvage vehicle to have sustained damage that:\n\nMakes the vehicle unsafe to drive\nMakes the vehicle unsafe for any repair technicians that might work on the vehicle\nMight damage Tesla equipment, such as Superchargers\nWhen a vehicle is classified as a salvaged vehicle:\n\nAny Tesla limited warranties and extended service agreements for the vehicle are void.", "NOTE: Repairs due to recalls will be performed unless the safe repair of the vehicle is prevented either by the condition of the vehicle or by vehicle modifications not installed by Tesla.", "If the Tesla Service Center determines that the vehicle is not safe to repair, the recall-related repair will not be performed until the customer has returned the vehicle to a condition that the Service Center determines is safe to repair.", "For more information about this policy, please contact a Tesla Service Center.", "Tesla’s mission is to accelerate the world’s transition to sustainable energy.", "Approach to risk management and governance in relation to UK taxation\n\nTesla is committed to being a responsible taxpayer and to comply with the tax laws and regulations in all the jurisdictions in which the Company operates, including the United Kingdom.", "Tesla is mindful of its reputation in the marketplace and aims to minimize the level of risk in relation to UK taxation.", "Tesla is not prepared to accept risk levels that expose the Company to reputational risks.", "However, given the scale of Tesla’s business and the complexity of tax legislation, it is inevitable that tax risks will arise.", "Relationship with HMRC\n\nTesla seeks to maintain an open, professional and transparent relationship with Her Majesty’s Revenue & Customs (‘HMRC’).", "In this respect, Tesla commits to make full and accurate disclosures in tax returns and in correspondence with HMRC."]
}, {
    "entity": "Contract",
    "sentences": ["Tesla, Inc\nAttn: Legal,\n45500 Fremont Boulevard\nFremont, CA 94538\n(650) 681-5000\n\nTerms of Use\n\nPayment Terms for Services\nPremium Connectivity\nRevocation Policy\nSupercharger Fair Use Policy\nTesla Intellectual Property\nPayment Terms for Services\n\nThese Terms of Service describe your agreement to pay for future services and charges.", "This Agreement shall have no effect on the terms and conditions of any agreement that you have entered into with a third party.", "Your Agreement to Pay\nYou are responsible for paying all amounts due on time and in full and to keep an active credit card on file with us.", "We will automatically debit your monthly payment from this credit card on the monthly anniversary of the effective date of this Agreement unless you cancel your Service before the applicable day of renewal.", "Tesla shall be liable without limitation under the Agreement for damages resulting from intentional or negligent injury to life, body or health and for other damages resulting from intentional or grossly negligent conduct by Tesla or its legal representatives or agents.", "Material contractual obligations are obligations whose fulfilment is essential for the proper execution of the Agreement and on whose fulfilment you regularly rely and may rely (cardinal obligations).", "Additional Terms\nGoverning Law\nThe terms of this Agreement are governed by, and to be interpreted according to, the laws of the country in which we are licensed to sell motor vehicles that is nearest to your address that you input onto our website when placing this order.", "We are not responsible for any statements, agreements, representations, warranties or covenants, oral or written, including, without limitation, any statements from third parties, concerning or relating to the Service provided to you pursuant to these Terms & Conditions, unless such statements, agreements, representations warranties or covenants are expressly contained in or incorporate by these Terms & Conditions.", "Survivorship\nEven after your Service has ended and unless it has been replaced by a new agreement expressly entered into by and between us, the provisions of these Terms & Conditions shall survive.", "Revocation Policy\n\nRight of Revocation\n\nIf you are a consumer and have concluded this Agreement exclusively by using means of remote communication (such as via the internet, telephone, e-mail or similar), you have the right to revoke this contract within fourteen days without stating reasons in accordance with the following provisions.", "Consequences of Revocation\n\nIf you revoke this Agreement, we shall reimburse you for all payments we have received from you, including delivery charges (except for additional charges resulting from your choosing a different method of delivery from the cheapest standard delivery offered by us), immediately and no later than fourteen days from the date we receive notification of your revocation of this Agreement.", "Until Tesla can confirm that the vehicle is in compliance with Tesla’s safety standards and vehicle specifications, Tesla does not perform or support repairs involving the HV (high-voltage) battery systems in the vehicle because of the potential for the salvage vehicle to have sustained damage that:\n\nMakes the vehicle unsafe to drive\nMakes the vehicle unsafe for any repair technicians that might work on the vehicle\nMight damage Tesla equipment, such as Superchargers\nWhen a vehicle is classified as a salvaged vehicle:\n\nAny Tesla limited warranties and extended service agreements for the vehicle are void.", "Unless Tesla has unlimited liability under the provisions of the previous paragraph, in case of a breach of a material contractual obligation due to ordinary negligence, Tesla's liability for damages or reimbursement of expenses shall be limited to typically foreseeable damages.", "a letter, fax or e-mail sent by post) of your decision to revoke this contract.", "Model Revocation Form\n\n(If you want to cancel the contract, please fill out this form and send it back).", "To Tesla Motors Limited, 197 Horton Road, West Drayton UB7 8JD, United Kingdom:\nHereby I/we (*) revoke the contract concluded by me/us (*) for the purchase of the following goods (*)/the provision of the following service (*)\nOrdered on (*)/received on (*) -Name of consumer(s)\nAddress of the consumer(s)\nSignature of the consumer(s) (only in the case of paper notification)\n(*) Delete as appropriate\n\n \n\nSupercharger Fair Use Policy\n\nIntroduction\n\nWe are continually expanding our global network of Supercharger stations to enable personal long distance travel and to provide a charging solution for those without immediate access to home or workplace charging, thereby accelerating the widespread adoption of electric vehicles.", "Supplier Compliance\n\nTesla will do the following to ensure compliance by its suppliers with this policy as required by law and as needed:\n\nEvaluate its supply chain to address risks related to conflict minerals, human trafficking, slavery and child labor;\nAudit suppliers, to evaluate supplier compliance with Tesla's Human Rights and Conflict Minerals Policy;\nRequire direct suppliers to certify that materials incorporated into Tesla products comply with the laws regarding conflict minerals, slavery, child labor and human trafficking of the country or countries in which they are doing business;\nDiscipline employees or contractors, including potential termination of contract, who fail to meet Tesla's Human Rights and Conflict Minerals Policy;\nTrain certain Tesla employees regarding conflict minerals, human trafficking, child labor and slavery, particularly with respect to mitigating risks within the Tesla's supply chain;\nInvestigate if Tesla has a reasonable basis to believe that a Tesla supplier is engaging in human trafficking, slave or child labor, or use of conflict minerals; and\nTransition away from purchasing goods or services from any supplier that is believed to be engaging in human trafficking, slave or child labor, or use of conflict minerals if the supplier does not take corrective actions within a reasonable period of time."]
}, {
    "entity": "E-mail",
    "sentences": ["You can withdraw your consent to receive commercial electronic messages at any time by clicking \"unsubscribe\" at the bottom of these emails or Tesla app message, or letting our customer representative know about your decision.", "You may also provide comments or report concerns by email to: legal@tesla.com.", "Revocation Policy\n\nRight of Revocation\n\nIf you are a consumer and have concluded this Agreement exclusively by using means of remote communication (such as via the internet, telephone, e-mail or similar), you have the right to revoke this contract within fourteen days without stating reasons in accordance with the following provisions.", "a letter, fax or e-mail sent by post) of your decision to revoke this contract."]
}, {
    "entity": "Nikola Tesla",
    "sentences": ["Information We May Collect\nWe collect three main types of information related to you or your use of our products and services: \n\n(1) Information from or about you or your devices \n(2) Information from or about your Tesla vehicle \n(3) Information from or about your Tesla energy products \n\nDepending on the Tesla products and services you request, own, or use, not all of these types of information may be applicable.", "Tesla Updates may be tailored to your needs and interests that we may infer from your interaction with us.", "You can withdraw your consent to receive commercial electronic messages at any time by clicking \"unsubscribe\" at the bottom of these emails or Tesla app message, or letting our customer representative know about your decision.", "Some messages directly related to a Tesla purchase cannot be opted out of.", "Tesla, Inc\nAttn: Legal,\n45500 Fremont Boulevard\nFremont, CA 94538\n(650) 681-5000\n\nTerms of Use\n\nPayment Terms for Services\nPremium Connectivity\nRevocation Policy\nSupercharger Fair Use Policy\nTesla Intellectual Property\nPayment Terms for Services\n\nThese Terms of Service describe your agreement to pay for future services and charges.", "Tesla may amend these terms and any changes are effective when posted to this page.", "Tesla may collect payment from you, including by using the credit card saved in your Tesla Account.", "You will be able to review a summary of transactions in your Tesla Account.", "To avoid idle fees, we recommend you monitor your vehicle while using a Supercharger and encourage you to use the Tesla mobile app to track your vehicle's charge status.", "We will notify you of such change by posting the amended terms on our website and/or on your Tesla Account.", "Cancellation by You\nYou may cancel the Service at any time through your Tesla Account or by contacting our Customer Support team and notifying us that you want to cancel the Service.", "Disclaimer of Warranties\nTESLA DOES NOT WARRANT OR GUARANTEE THAT SERVICE WILL BE AVAILABLE AT ANY SPECIFIC TIME OR AT ALL TIMES OR TO ANY GEOGRAPHIC LOCATION, OR THAT THE SERVICE WILL BE PROVIDED WITHOUT INTERRUPTION, DELAY OR ERROR.", "In addition, neither we, any Tesla entity nor our service partners are liable (1) for our inability to contact any service partner or other party in any particular situation (including any emergency personnel), (2) for any act or omission of any other company furnishing a part of our Service or any equipment provided for such Service, (3) for errors or omissions of any vendors, dealers or manufacturers participating in offers made through us, or (4) for any damages that result from or arise out of the use, installation, repair or maintenance by you (or by any person you authorize) of the Service, or any product or service provided by or manufactured by third parties.", "Tesla shall be liable without limitation under the Agreement for damages resulting from intentional or negligent injury to life, body or health and for other damages resulting from intentional or grossly negligent conduct by Tesla or its legal representatives or agents.", "Unless Tesla has unlimited liability under the provisions of the previous paragraph, in case of a breach of a material contractual obligation due to ordinary negligence, Tesla's liability for damages or reimbursement of expenses shall be limited to typically foreseeable damages.", "In order to exercise your right of revocation, you must inform us (Tesla Motors Limited, 197 Horton Road, West Drayton UB7 8JD, United Kingdom) by means of a clear statement (e.g.", "To Tesla Motors Limited, 197 Horton Road, West Drayton UB7 8JD, United Kingdom:\nHereby I/we (*) revoke the contract concluded by me/us (*) for the purchase of the following goods (*)/the provision of the following service (*)\nOrdered on (*)/received on (*) -Name of consumer(s)\nAddress of the consumer(s)\nSignature of the consumer(s) (only in the case of paper notification)\n(*) Delete as appropriate\n\n \n\nSupercharger Fair Use Policy\n\nIntroduction\n\nWe are continually expanding our global network of Supercharger stations to enable personal long distance travel and to provide a charging solution for those without immediate access to home or workplace charging, thereby accelerating the widespread adoption of electric vehicles.", "Tesla may choose to exclude certain Supercharger stations or occasional trips from the scope of this Policy, such as to accommodate specific local circumstances.", "For questions related to home charging, please contact charginginstallation@tesla.com.", "No Licenses\n\nTesla, Inc. strives to achieve innovative and informative internet sites.", "Tesla, Inc. hopes that you will be as enthusiastic as we are about this creative effort.", "However, Tesla, Inc. must protect its intellectual property, including its patents, trademarks and copyrights.", "Accordingly, please be on notice that neither these internet sites, nor any material contained therein shall in any way grant or be taken to grant any person a license to Tesla, Inc.'s intellectual property.", "Policy\n\nHuman Rights And Conflict Minerals Policy\n\nTesla expects our suppliers to conduct their worldwide operations in responsible manner in adherence of this policy and the principles enumerated herein.", "Tesla works collaboratively with our suppliers to encourage compliance with the following principles:\n\nLegal And Regulatory Compliance\n\nTesla suppliers are to ensure their operations and the products and services supplied to Tesla comply with all national and other applicable laws and regulations.", "Conflict Minerals\n\nTesla's suppliers are expected to use reasonable efforts to ensure that parts and products supplied to Tesla are DRC \"conflict-free,\" meaning that such conflict minerals do not benefit armed groups in the Democratic Republic of the Congo.", "The goal of this policy is to ensure that Tesla's products do not directly or indirectly finance or benefit armed groups through mining or mineral trading in the DRC and adjoining countries.", "Tesla requires its suppliers to establish policies, due diligence frameworks, and management systems, consistent with the OECD Due Diligence Guidance for Responsible Supply Chains of Minerals from Conflict-Affected and High-Risk Areas, that are designed to accomplish this goal.", "Tesla expects its suppliers to stay up-to-date with and to use validated conflict free smelters and refiners assessed by the Responsible Mineral Initiative and similar organizations.", "Human Rights\n\nTesla is committed to ensuring that its suppliers do not use slave or child labor or engage in human trafficking.", "Tesla does not, and will not, tolerate the use of slave or child labor in the manufacture of its products and does not, and will not, accept products or services from suppliers that engage in human trafficking in any form.", "Supplier Compliance\n\nTesla will do the following to ensure compliance by its suppliers with this policy as required by law and as needed:\n\nEvaluate its supply chain to address risks related to conflict minerals, human trafficking, slavery and child labor;\nAudit suppliers, to evaluate supplier compliance with Tesla's Human Rights and Conflict Minerals Policy;\nRequire direct suppliers to certify that materials incorporated into Tesla products comply with the laws regarding conflict minerals, slavery, child labor and human trafficking of the country or countries in which they are doing business;\nDiscipline employees or contractors, including potential termination of contract, who fail to meet Tesla's Human Rights and Conflict Minerals Policy;\nTrain certain Tesla employees regarding conflict minerals, human trafficking, child labor and slavery, particularly with respect to mitigating risks within the Tesla's supply chain;\nInvestigate if Tesla has a reasonable basis to believe that a Tesla supplier is engaging in human trafficking, slave or child labor, or use of conflict minerals; and\nTransition away from purchasing goods or services from any supplier that is believed to be engaging in human trafficking, slave or child labor, or use of conflict minerals if the supplier does not take corrective actions within a reasonable period of time.", "Grievance Mechanism\n\nYou may contact Tesla's Board of Directors to provide comments or to report concerns.", "You may also provide comments or report concerns by email to: legal@tesla.com.", "https://os.tesla.com/parrot-sources/parrot-sources.tar.gz\n\nAdditional packages:\n\nFor Autopilot and Infotainment system image sources, see:\nhttp://github.com/teslamotors/buildroot\n\nMain branch is buildroot-2019.02\nSee README.Tesla for more information on contents and configurations\nFor Autopilot and Infotainment kernel sources, see:\nhttp://github.com/teslamotors/linux\n\nbranches:\nintel-4.1: Infotainment Intel kernel\ntegra-2.6: Infotainment Tegra kernel\ntegra-4.4: Infotainment Tegra kernel\ntesla-3.18-hw2: Autopilot Nvidia kernel\ntesla-3.18-hw25: Autopilot Nvidia kernel\ntesla-4.14-hw3: Autopilot Tesla kernel\nFor Autopilot coreboot sources, see:\nhttp://github.com/teslamotors/coreboot\n\ntesla-4.6-hw3\nForthcoming releases and estimated timelines:\n\nHarman Radio module for Model 3\nPass-through source drop: Q3 2018\nCellular modem modules for Model S/X/3\nPass-through source drops: Q3 2018\nPatent Pledge\n\nOn June 12, 2014, Tesla announced that it will not initiate patent lawsuits against anyone who, in good faith, wants to use its technology.", "Tesla was created to accelerate the advent of sustainable transport, and this policy is intended to encourage the advancement of a common, rapidly-evolving platform for electric vehicles, thereby benefiting Tesla, other companies making electric vehicles, and the world.", "Tesla’s Pledge\n\nTesla irrevocably pledges that it will not initiate a lawsuit against any party for infringing a Tesla Patent through activity relating to electric vehicles or related equipment for so long as such party is acting in good faith.", "A list of Tesla Patents subject to the Pledge will be maintained at the following URL: https://www.tesla.com/about/legal#patent-list.", "A party is \"acting in good faith\" for so long as such party and its related or affiliated companies have not:\n\nasserted, helped others assert or had a financial stake in any assertion of (i) any patent or other intellectual property right against Tesla or (ii) any patent right against a third party for its use of technologies relating to electric vehicles or related equipment;\nchallenged, helped others challenge, or had a financial stake in any challenge to any Tesla patent; or\nmarketed or sold any knock-off product (e.g., a product created by imitating or copying the design or appearance of a Tesla product or which suggests an association with or endorsement by Tesla) or provided any material assistance to another party doing so.", "Transfer of Tesla Patents\n\nShould Tesla ever transfer a Tesla Patent to a third party, it will do so only to a party that agrees, by means of a public declaration intended to be binding on such party, to provide the same protection that Tesla provided under the Pledge and to place the same requirement on any subsequent transferee.", "In order for Tesla to preserve its ability to enforce the Tesla Patents against any party not acting in good faith, the Pledge is not a waiver of any patent claims (including claims for damages for past acts of infringement) and is not a license, covenant not to sue, or authorization to engage in patented activities or a limitation on remedies, damages or claims.", "What this pledge means is that as long as someone uses our patents for electric vehicles and doesn’t do bad things, such as knocking off our products or using our patents and then suing us for intellectual property infringement, they should have no fear of Tesla asserting its patents against them.", "Tesla Conflict Minerals Report\n\nDownload PDF\n\nLast Updated May 2020\n\nTesla Supplier Code of Conduct\n\nDownload PDF\n\nLast Updated June 2017\n\nTesla UK Modern Slavery Act Transparency Statement\n\nDownload 2019 Report PDF\n\nLast Updated June 2020\n\nDownload 2018 Report PDF\n\nDownload 2017 Report PDF\n\nDownload 2016 Report PDF\n\nUnsupported or Salvaged Vehicle Policy\n\nAn unsupported or salvaged vehicle is a vehicle that has been declared a total loss, commonly after extensive damage caused by a crash, flooding, fire, or similar hazard, and has been (or qualifies to be) registered and/or titled by its owner as a salvaged vehicle or its equivalent pursuant to local jurisdiction or industry practice.", "Tesla does not warrant the safety or operability of salvaged vehicles.", "Repairs performed to bring a salvaged vehicle back into service may not meet Tesla standards or specifications and that is why the vehicle is unsupported.", "Until Tesla can confirm that the vehicle is in compliance with Tesla’s safety standards and vehicle specifications, Tesla does not perform or support repairs involving the HV (high-voltage) battery systems in the vehicle because of the potential for the salvage vehicle to have sustained damage that:\n\nMakes the vehicle unsafe to drive\nMakes the vehicle unsafe for any repair technicians that might work on the vehicle\nMight damage Tesla equipment, such as Superchargers\nWhen a vehicle is classified as a salvaged vehicle:\n\nAny Tesla limited warranties and extended service agreements for the vehicle are void.", "NOTE: Repairs due to recalls will be performed unless the safe repair of the vehicle is prevented either by the condition of the vehicle or by vehicle modifications not installed by Tesla.", "If the Tesla Service Center determines that the vehicle is not safe to repair, the recall-related repair will not be performed until the customer has returned the vehicle to a condition that the Service Center determines is safe to repair.", "For more information about this policy, please contact a Tesla Service Center.", "Tesla’s mission is to accelerate the world’s transition to sustainable energy.", "Approach to risk management and governance in relation to UK taxation\n\nTesla is committed to being a responsible taxpayer and to comply with the tax laws and regulations in all the jurisdictions in which the Company operates, including the United Kingdom.", "Tesla is mindful of its reputation in the marketplace and aims to minimize the level of risk in relation to UK taxation.", "Tesla is not prepared to accept risk levels that expose the Company to reputational risks.", "However, given the scale of Tesla’s business and the complexity of tax legislation, it is inevitable that tax risks will arise.", "Relationship with HMRC\n\nTesla seeks to maintain an open, professional and transparent relationship with Her Majesty’s Revenue & Customs (‘HMRC’).", "In this respect, Tesla commits to make full and accurate disclosures in tax returns and in correspondence with HMRC."]
}, {
    "entity": "Failure",
    "sentences": ["Termination, Suspension, Reactivation, Change and Transfer of Service\nSuspension or Termination\nWe can decide to either suspend or terminate the Service without warning, or issue a warning including for network or system maintenance, improvement, or failure or if we suspect your Service is being used for any unauthorized or inappropriate purpose, as a result of your breach of these Terms & Conditions or for reasons unrelated to you or your account with us.", "Some examples are atmospheric, geographic, or topographic conditions (such as tall buildings, hills or tunnels), damage to or failure to maintain your Vehicle or the equipment in good working order, government laws, rules or regulations, failure, congestion or outages of utility or wireless networks (including interruption of cellular service), war, act of God, natural disaster, inclement weather, and labor strikes.", "If you fail to notify us, you will remain responsible for all charges for any Service incurred in connection with such Vehicle.", "Supplier Compliance\n\nTesla will do the following to ensure compliance by its suppliers with this policy as required by law and as needed:\n\nEvaluate its supply chain to address risks related to conflict minerals, human trafficking, slavery and child labor;\nAudit suppliers, to evaluate supplier compliance with Tesla's Human Rights and Conflict Minerals Policy;\nRequire direct suppliers to certify that materials incorporated into Tesla products comply with the laws regarding conflict minerals, slavery, child labor and human trafficking of the country or countries in which they are doing business;\nDiscipline employees or contractors, including potential termination of contract, who fail to meet Tesla's Human Rights and Conflict Minerals Policy;\nTrain certain Tesla employees regarding conflict minerals, human trafficking, child labor and slavery, particularly with respect to mitigating risks within the Tesla's supply chain;\nInvestigate if Tesla has a reasonable basis to believe that a Tesla supplier is engaging in human trafficking, slave or child labor, or use of conflict minerals; and\nTransition away from purchasing goods or services from any supplier that is believed to be engaging in human trafficking, slave or child labor, or use of conflict minerals if the supplier does not take corrective actions within a reasonable period of time."]
}, {
    "entity": "Services",
    "sentences": ["Information We May Collect\nWe collect three main types of information related to you or your use of our products and services: \n\n(1) Information from or about you or your devices \n(2) Information from or about your Tesla vehicle \n(3) Information from or about your Tesla energy products \n\nDepending on the Tesla products and services you request, own, or use, not all of these types of information may be applicable.", "How We May Use Your Information\nWe may use information we collect to: \n\n(1) Communicate with you \n(2) Fulfill our products and services \n(3) Improve and enhance development of our products and services \n\nThis includes contacting you (or other necessary parties) to advise you of important safety-related information, to notify first responders in the event of an accident involving your vehicle, present products and offers tailored to you, or to respond to your inquiries and fulfill your requests for product information, newsletters, or other events.", "Sharing Your Information\nWe may share information with: \n\n(1) Our service providers and business partners when necessary to perform services on our or on your behalf \n(2) Third parties you authorize \n(3) Other third parties as required by law \n\nSome examples of when we may share your information include, payment processing, order fulfillment, product installation, customer service, marketing, financing, service or repair, and other similar services.", "Choice and Transparency\nWe enable you to access and control the data that we collect, use and share from or about you, or your use of our products or services, including through device permissions, in-app settings, marketing opt-outs, and disabling collection of certain vehicle data.", "How to Contact Us\nFor questions or comments, to opt out from certain services, or to submit a data privacy request, please contact us.", "Tesla, Inc\nAttn: Legal,\n45500 Fremont Boulevard\nFremont, CA 94538\n(650) 681-5000\n\nTerms of Use\n\nPayment Terms for Services\nPremium Connectivity\nRevocation Policy\nSupercharger Fair Use Policy\nTesla Intellectual Property\nPayment Terms for Services\n\nThese Terms of Service describe your agreement to pay for future services and charges.", "The services or charges described below may result in charges to you, even if someone else is using your vehicle.", "If we are unable to collect payment, we may contact you based on your information on file, or may request payment when we are performing services for you.", "If you do not pay past due amounts we may limit or block your vehicle's ability to use the related services until payment issues are resolved.", "Changes to Terms & Conditions\nWe can change these Terms & Conditions; change, add or delete Services or the features included therein; and change the prices we charge for the Service, at any time.", "Any change in prices for your Service or any material reduction in the features of your Service will not take effect until the next monthly period of the Service has expired.", "If you do not cancel your Service prior to the applicable effective date of the changes, your Service will be modified to reflect the applicable change to prices and/or features charged for your Service.", "Payment Provisions\nThird Party Charges\nYou are responsible for paying directly to third parties all charges for services furnished by them directly to you that are not expressly covered by your Service.", "We will automatically debit your monthly payment from this credit card on the monthly anniversary of the effective date of this Agreement unless you cancel your Service before the applicable day of renewal.", "We may terminate or suspend your Service without notice to you, if your credit, charge or debit card provider refuses a charge from us or if such card has otherwise expired.", "Even if we terminate or suspend your Service, you will still be responsible for any charges due at the time of such suspension or termination.", "Termination, Suspension, Reactivation, Change and Transfer of Service\nSuspension or Termination\nWe can decide to either suspend or terminate the Service without warning, or issue a warning including for network or system maintenance, improvement, or failure or if we suspect your Service is being used for any unauthorized or inappropriate purpose, as a result of your breach of these Terms & Conditions or for reasons unrelated to you or your account with us.", "If suspension or termination of the Service occurs for any reason, you acknowledge and agree that you may not be able to access the Service.", "If we elect to terminate your Service, you will be entitled to a pro rata refund or credit of the prepaid charges determined on the remaining monthly term of the Service.", "Cancellation by You\nYou may cancel the Service at any time through your Tesla Account or by contacting our Customer Support team and notifying us that you want to cancel the Service.", "If you cancel, your cancelation of the Service will only be effective from the end of the current monthly subscription term.", "Reactivation of Service\nYou do not have any right to have your Service reactivated, even if you cure any of the issues that resulted in the termination or suspension of your Service.", "It is solely our decision as to whether to allow you to have Service again.", "If we do decide to reactivate your Service, we have the right to charge a reactivation fee.", "If you fail to notify us, you will remain responsible for all charges for any Service incurred in connection with such Vehicle.", "Your Responsibility for Maintaining Your Vehicle\nIn order for us to provide the Service, your Vehicle must be in good working order and your Vehicle must have a working electrical system and adequate battery power.", "The Service may not work if you try to modify or add any equipment or software in or to your Vehicle that is not expressly authorized by us or is not compatible with the Service.", "Certain information you receive through the Service belongs to us (or other third parties) and may be subject to one or more copyrights, trademarks, service marks, patents, or other legal protections.", "You may not (and may not permit or cause any other party to) sell or resell or otherwise use the Service or any information provided through the Service for commercial purposes, nor may you reproduce, copy, modify, attempt to reverse engineer, make derivative works from or otherwise display or distribute information provided through the Service.", "Events Beyond Our Control\nVarious conditions beyond our control may prevent or delay us from providing Service to you, or affect the quality of the Service.", "Some examples are atmospheric, geographic, or topographic conditions (such as tall buildings, hills or tunnels), damage to or failure to maintain your Vehicle or the equipment in good working order, government laws, rules or regulations, failure, congestion or outages of utility or wireless networks (including interruption of cellular service), war, act of God, natural disaster, inclement weather, and labor strikes.", "In the event of any regulatory, governmental or other legally-compelled changes, or discontinuation or change of necessary telecommunications systems and services (e.g., if our Wireless Service Provider terminates or restricts wireless services of the type used by your Vehicle’s equipment), you are solely responsible for replacing, as well as the cost of replacing, any equipment that is necessitated as a result of such change or discontinuation, except that if such change occurs during your Vehicle’s base warranty period, while you will still be responsible for the cost of such replacement, we will be responsible for obtaining and providing you with the necessary replacement materials (if applicable).", "Disclaimer of Warranties\nTESLA DOES NOT WARRANT OR GUARANTEE THAT SERVICE WILL BE AVAILABLE AT ANY SPECIFIC TIME OR AT ALL TIMES OR TO ANY GEOGRAPHIC LOCATION, OR THAT THE SERVICE WILL BE PROVIDED WITHOUT INTERRUPTION, DELAY OR ERROR.", "Such warranty does not cover the Service, in whole or in part.", "In addition, neither we, any Tesla entity nor our service partners are liable (1) for our inability to contact any service partner or other party in any particular situation (including any emergency personnel), (2) for any act or omission of any other company furnishing a part of our Service or any equipment provided for such Service, (3) for errors or omissions of any vendors, dealers or manufacturers participating in offers made through us, or (4) for any damages that result from or arise out of the use, installation, repair or maintenance by you (or by any person you authorize) of the Service, or any product or service provided by or manufactured by third parties.", "In these cases, if you experience problems or dissatisfaction with the Service, your sole and exclusive remedy is to cancel the Service and discontinue using the Service.", "You agree that the limitations of liability and indemnities in these Terms & Conditions will survive even after your Service has terminated.", "We own or have rights to all such software and you do not acquire any rights in such software other than the right to use such software as reasonably necessary for you to use the Service as permitted in your Terms & Conditions.", "We are not responsible for any lost or erased (or otherwise affected) data and you are solely responsible for the data that you may have downloaded, uploaded, transmitted or otherwise stored from, to, on or through the equipment or Service.", "You understand that software available is dependent on vehicle configuration and geographical region, which may affect your access to the Service and/or any of its features.", "We are not responsible for any statements, agreements, representations, warranties or covenants, oral or written, including, without limitation, any statements from third parties, concerning or relating to the Service provided to you pursuant to these Terms & Conditions, unless such statements, agreements, representations warranties or covenants are expressly contained in or incorporate by these Terms & Conditions.", "Survivorship\nEven after your Service has ended and unless it has been replaced by a new agreement expressly entered into by and between us, the provisions of these Terms & Conditions shall survive.", "To Tesla Motors Limited, 197 Horton Road, West Drayton UB7 8JD, United Kingdom:\nHereby I/we (*) revoke the contract concluded by me/us (*) for the purchase of the following goods (*)/the provision of the following service (*)\nOrdered on (*)/received on (*) -Name of consumer(s)\nAddress of the consumer(s)\nSignature of the consumer(s) (only in the case of paper notification)\n(*) Delete as appropriate\n\n \n\nSupercharger Fair Use Policy\n\nIntroduction\n\nWe are continually expanding our global network of Supercharger stations to enable personal long distance travel and to provide a charging solution for those without immediate access to home or workplace charging, thereby accelerating the widespread adoption of electric vehicles.", "Supercharger Fair Use\n\nTo help ensure that Superchargers are available for their intended use, unless you charge on a pay per use basis, we ask that you not charge your vehicle using a Supercharger if your vehicle is being used:\n\nas a taxi;\nfor ridesourcing or ridesharing (through Uber, Lyft or similar services);\nto commercially deliver or transport goods;\nfor government purposes; or\nfor any other commercial venture.", "Tesla works collaboratively with our suppliers to encourage compliance with the following principles:\n\nLegal And Regulatory Compliance\n\nTesla suppliers are to ensure their operations and the products and services supplied to Tesla comply with all national and other applicable laws and regulations.", "Tesla does not, and will not, tolerate the use of slave or child labor in the manufacture of its products and does not, and will not, accept products or services from suppliers that engage in human trafficking in any form.", "Supplier Compliance\n\nTesla will do the following to ensure compliance by its suppliers with this policy as required by law and as needed:\n\nEvaluate its supply chain to address risks related to conflict minerals, human trafficking, slavery and child labor;\nAudit suppliers, to evaluate supplier compliance with Tesla's Human Rights and Conflict Minerals Policy;\nRequire direct suppliers to certify that materials incorporated into Tesla products comply with the laws regarding conflict minerals, slavery, child labor and human trafficking of the country or countries in which they are doing business;\nDiscipline employees or contractors, including potential termination of contract, who fail to meet Tesla's Human Rights and Conflict Minerals Policy;\nTrain certain Tesla employees regarding conflict minerals, human trafficking, child labor and slavery, particularly with respect to mitigating risks within the Tesla's supply chain;\nInvestigate if Tesla has a reasonable basis to believe that a Tesla supplier is engaging in human trafficking, slave or child labor, or use of conflict minerals; and\nTransition away from purchasing goods or services from any supplier that is believed to be engaging in human trafficking, slave or child labor, or use of conflict minerals if the supplier does not take corrective actions within a reasonable period of time.", "Repairs performed to bring a salvaged vehicle back into service may not meet Tesla standards or specifications and that is why the vehicle is unsupported.", "Until Tesla can confirm that the vehicle is in compliance with Tesla’s safety standards and vehicle specifications, Tesla does not perform or support repairs involving the HV (high-voltage) battery systems in the vehicle because of the potential for the salvage vehicle to have sustained damage that:\n\nMakes the vehicle unsafe to drive\nMakes the vehicle unsafe for any repair technicians that might work on the vehicle\nMight damage Tesla equipment, such as Superchargers\nWhen a vehicle is classified as a salvaged vehicle:\n\nAny Tesla limited warranties and extended service agreements for the vehicle are void.", "If the Tesla Service Center determines that the vehicle is not safe to repair, the recall-related repair will not be performed until the customer has returned the vehicle to a condition that the Service Center determines is safe to repair.", "For more information about this policy, please contact a Tesla Service Center."]
}, {
    "entity": "Copyright infringement",
    "sentences": ["Termination, Suspension, Reactivation, Change and Transfer of Service\nSuspension or Termination\nWe can decide to either suspend or terminate the Service without warning, or issue a warning including for network or system maintenance, improvement, or failure or if we suspect your Service is being used for any unauthorized or inappropriate purpose, as a result of your breach of these Terms & Conditions or for reasons unrelated to you or your account with us."]
}, {
    "entity": "Breach of contract",
    "sentences": ["Termination, Suspension, Reactivation, Change and Transfer of Service\nSuspension or Termination\nWe can decide to either suspend or terminate the Service without warning, or issue a warning including for network or system maintenance, improvement, or failure or if we suspect your Service is being used for any unauthorized or inappropriate purpose, as a result of your breach of these Terms & Conditions or for reasons unrelated to you or your account with us.", "Unless Tesla has unlimited liability under the provisions of the previous paragraph, in case of a breach of a material contractual obligation due to ordinary negligence, Tesla's liability for damages or reimbursement of expenses shall be limited to typically foreseeable damages.", "Waiver; Severability\nNo waiver of any part of these Terms & Conditions, or of any breach of it, in any one instance will require us to waive any other instance or breach."]
}, {
    "entity": "Contractual term",
    "sentences": ["Changes to Terms & Conditions\nWe can change these Terms & Conditions; change, add or delete Services or the features included therein; and change the prices we charge for the Service, at any time.", "It is your responsibility to review these Terms & Conditions periodically.", "Termination, Suspension, Reactivation, Change and Transfer of Service\nSuspension or Termination\nWe can decide to either suspend or terminate the Service without warning, or issue a warning including for network or system maintenance, improvement, or failure or if we suspect your Service is being used for any unauthorized or inappropriate purpose, as a result of your breach of these Terms & Conditions or for reasons unrelated to you or your account with us.", "You agree that the limitations of liability and indemnities in these Terms & Conditions will survive even after your Service has terminated.", "We own or have rights to all such software and you do not acquire any rights in such software other than the right to use such software as reasonably necessary for you to use the Service as permitted in your Terms & Conditions.", "We are not responsible for any statements, agreements, representations, warranties or covenants, oral or written, including, without limitation, any statements from third parties, concerning or relating to the Service provided to you pursuant to these Terms & Conditions, unless such statements, agreements, representations warranties or covenants are expressly contained in or incorporate by these Terms & Conditions.", "Survivorship\nEven after your Service has ended and unless it has been replaced by a new agreement expressly entered into by and between us, the provisions of these Terms & Conditions shall survive.", "Waiver; Severability\nNo waiver of any part of these Terms & Conditions, or of any breach of it, in any one instance will require us to waive any other instance or breach.", "Tesla, Inc\nAttn: Legal,\n45500 Fremont Boulevard\nFremont, CA 94538\n(650) 681-5000\n\nTerms of Use\n\nPayment Terms for Services\nPremium Connectivity\nRevocation Policy\nSupercharger Fair Use Policy\nTesla Intellectual Property\nPayment Terms for Services\n\nThese Terms of Service describe your agreement to pay for future services and charges.", "Tesla may amend these terms and any changes are effective when posted to this page.", "We will notify you of such change by posting the amended terms on our website and/or on your Tesla Account.", "This Agreement shall have no effect on the terms and conditions of any agreement that you have entered into with a third party.", "All charges will be charged in advance of the term to which they apply.", "We may terminate or suspend your Service without notice to you, if your credit, charge or debit card provider refuses a charge from us or if such card has otherwise expired.", "Even if we terminate or suspend your Service, you will still be responsible for any charges due at the time of such suspension or termination.", "If suspension or termination of the Service occurs for any reason, you acknowledge and agree that you may not be able to access the Service.", "If we elect to terminate your Service, you will be entitled to a pro rata refund or credit of the prepaid charges determined on the remaining monthly term of the Service.", "If you cancel, your cancelation of the Service will only be effective from the end of the current monthly subscription term.", "Reactivation of Service\nYou do not have any right to have your Service reactivated, even if you cure any of the issues that resulted in the termination or suspension of your Service.", "In the event of any regulatory, governmental or other legally-compelled changes, or discontinuation or change of necessary telecommunications systems and services (e.g., if our Wireless Service Provider terminates or restricts wireless services of the type used by your Vehicle’s equipment), you are solely responsible for replacing, as well as the cost of replacing, any equipment that is necessitated as a result of such change or discontinuation, except that if such change occurs during your Vehicle’s base warranty period, while you will still be responsible for the cost of such replacement, we will be responsible for obtaining and providing you with the necessary replacement materials (if applicable).", "Additional Terms\nGoverning Law\nThe terms of this Agreement are governed by, and to be interpreted according to, the laws of the country in which we are licensed to sell motor vehicles that is nearest to your address that you input onto our website when placing this order.", "Supplier Compliance\n\nTesla will do the following to ensure compliance by its suppliers with this policy as required by law and as needed:\n\nEvaluate its supply chain to address risks related to conflict minerals, human trafficking, slavery and child labor;\nAudit suppliers, to evaluate supplier compliance with Tesla's Human Rights and Conflict Minerals Policy;\nRequire direct suppliers to certify that materials incorporated into Tesla products comply with the laws regarding conflict minerals, slavery, child labor and human trafficking of the country or countries in which they are doing business;\nDiscipline employees or contractors, including potential termination of contract, who fail to meet Tesla's Human Rights and Conflict Minerals Policy;\nTrain certain Tesla employees regarding conflict minerals, human trafficking, child labor and slavery, particularly with respect to mitigating risks within the Tesla's supply chain;\nInvestigate if Tesla has a reasonable basis to believe that a Tesla supplier is engaging in human trafficking, slave or child labor, or use of conflict minerals; and\nTransition away from purchasing goods or services from any supplier that is believed to be engaging in human trafficking, slave or child labor, or use of conflict minerals if the supplier does not take corrective actions within a reasonable period of time.", "If the Tesla Service Center determines that the vehicle is not safe to repair, the recall-related repair will not be performed until the customer has returned the vehicle to a condition that the Service Center determines is safe to repair.", "A “Salvage-Titled Vehicle HV Safety Inspection” may be performed (at the customer’s expense) on the vehicle to determine if the HV-related components are safe to work on or access."]
}, {
    "entity": "Duty",
    "sentences": ["It is your responsibility to review these Terms & Conditions periodically.", "It is your responsibility to remove all data and content (including any personal information), if any, that you may have stored on your system before you sell or transfer your Vehicle.", "Your Responsibility for Maintaining Your Vehicle\nIn order for us to provide the Service, your Vehicle must be in good working order and your Vehicle must have a working electrical system and adequate battery power."]
}, {
    "entity": "Data",
    "sentences": ["Choice and Transparency\nWe enable you to access and control the data that we collect, use and share from or about you, or your use of our products or services, including through device permissions, in-app settings, marketing opt-outs, and disabling collection of certain vehicle data.", "How to Contact Us\nFor questions or comments, to opt out from certain services, or to submit a data privacy request, please contact us.", "It is your responsibility to remove all data and content (including any personal information), if any, that you may have stored on your system before you sell or transfer your Vehicle.", "These software updates and modifications may affect or erase data that you have previously stored on the equipment in your Vehicle (such as specific route or destination information).", "We are not responsible for any lost or erased (or otherwise affected) data and you are solely responsible for the data that you may have downloaded, uploaded, transmitted or otherwise stored from, to, on or through the equipment or Service."]
}, {
    "entity": "Computer",
    "sentences": ["Termination, Suspension, Reactivation, Change and Transfer of Service\nSuspension or Termination\nWe can decide to either suspend or terminate the Service without warning, or issue a warning including for network or system maintenance, improvement, or failure or if we suspect your Service is being used for any unauthorized or inappropriate purpose, as a result of your breach of these Terms & Conditions or for reasons unrelated to you or your account with us.", "It is your responsibility to remove all data and content (including any personal information), if any, that you may have stored on your system before you sell or transfer your Vehicle.", "Your Responsibility for Maintaining Your Vehicle\nIn order for us to provide the Service, your Vehicle must be in good working order and your Vehicle must have a working electrical system and adequate battery power.", "In the event of any regulatory, governmental or other legally-compelled changes, or discontinuation or change of necessary telecommunications systems and services (e.g., if our Wireless Service Provider terminates or restricts wireless services of the type used by your Vehicle’s equipment), you are solely responsible for replacing, as well as the cost of replacing, any equipment that is necessitated as a result of such change or discontinuation, except that if such change occurs during your Vehicle’s base warranty period, while you will still be responsible for the cost of such replacement, we will be responsible for obtaining and providing you with the necessary replacement materials (if applicable).", "Tesla requires its suppliers to establish policies, due diligence frameworks, and management systems, consistent with the OECD Due Diligence Guidance for Responsible Supply Chains of Minerals from Conflict-Affected and High-Risk Areas, that are designed to accomplish this goal.", "https://os.tesla.com/parrot-sources/parrot-sources.tar.gz\n\nAdditional packages:\n\nFor Autopilot and Infotainment system image sources, see:\nhttp://github.com/teslamotors/buildroot\n\nMain branch is buildroot-2019.02\nSee README.Tesla for more information on contents and configurations\nFor Autopilot and Infotainment kernel sources, see:\nhttp://github.com/teslamotors/linux\n\nbranches:\nintel-4.1: Infotainment Intel kernel\ntegra-2.6: Infotainment Tegra kernel\ntegra-4.4: Infotainment Tegra kernel\ntesla-3.18-hw2: Autopilot Nvidia kernel\ntesla-3.18-hw25: Autopilot Nvidia kernel\ntesla-4.14-hw3: Autopilot Tesla kernel\nFor Autopilot coreboot sources, see:\nhttp://github.com/teslamotors/coreboot\n\ntesla-4.6-hw3\nForthcoming releases and estimated timelines:\n\nHarman Radio module for Model 3\nPass-through source drop: Q3 2018\nCellular modem modules for Model S/X/3\nPass-through source drops: Q3 2018\nPatent Pledge\n\nOn June 12, 2014, Tesla announced that it will not initiate patent lawsuits against anyone who, in good faith, wants to use its technology.", "Until Tesla can confirm that the vehicle is in compliance with Tesla’s safety standards and vehicle specifications, Tesla does not perform or support repairs involving the HV (high-voltage) battery systems in the vehicle because of the potential for the salvage vehicle to have sustained damage that:\n\nMakes the vehicle unsafe to drive\nMakes the vehicle unsafe for any repair technicians that might work on the vehicle\nMight damage Tesla equipment, such as Superchargers\nWhen a vehicle is classified as a salvaged vehicle:\n\nAny Tesla limited warranties and extended service agreements for the vehicle are void."]
}, {
    "entity": "Tesla Supercharger",
    "sentences": ["Tesla, Inc\nAttn: Legal,\n45500 Fremont Boulevard\nFremont, CA 94538\n(650) 681-5000\n\nTerms of Use\n\nPayment Terms for Services\nPremium Connectivity\nRevocation Policy\nSupercharger Fair Use Policy\nTesla Intellectual Property\nPayment Terms for Services\n\nThese Terms of Service describe your agreement to pay for future services and charges.", "Idle Fee\n\nIn consideration of others who need to use a Supercharger, we ask that you move your vehicle when it is finished charging.", "To avoid idle fees, we recommend you monitor your vehicle while using a Supercharger and encourage you to use the Tesla mobile app to track your vehicle's charge status.", "For additional information, please see our Supercharger support page.", "To Tesla Motors Limited, 197 Horton Road, West Drayton UB7 8JD, United Kingdom:\nHereby I/we (*) revoke the contract concluded by me/us (*) for the purchase of the following goods (*)/the provision of the following service (*)\nOrdered on (*)/received on (*) -Name of consumer(s)\nAddress of the consumer(s)\nSignature of the consumer(s) (only in the case of paper notification)\n(*) Delete as appropriate\n\n \n\nSupercharger Fair Use Policy\n\nIntroduction\n\nWe are continually expanding our global network of Supercharger stations to enable personal long distance travel and to provide a charging solution for those without immediate access to home or workplace charging, thereby accelerating the widespread adoption of electric vehicles.", "Supercharger Fair Use\n\nTo help ensure that Superchargers are available for their intended use, unless you charge on a pay per use basis, we ask that you not charge your vehicle using a Supercharger if your vehicle is being used:\n\nas a taxi;\nfor ridesourcing or ridesharing (through Uber, Lyft or similar services);\nto commercially deliver or transport goods;\nfor government purposes; or\nfor any other commercial venture.", "If you charge your vehicle in a manner that does not comply with this Supercharger Fair Use Policy, we may ask you to modify this behavior.", "We may also take additional action to protect the availability of Superchargers for their intended purpose, such as limiting or blocking your vehicle’s ability to use Supercharger stations.", "Tesla may choose to exclude certain Supercharger stations or occasional trips from the scope of this Policy, such as to accommodate specific local circumstances.", "Until Tesla can confirm that the vehicle is in compliance with Tesla’s safety standards and vehicle specifications, Tesla does not perform or support repairs involving the HV (high-voltage) battery systems in the vehicle because of the potential for the salvage vehicle to have sustained damage that:\n\nMakes the vehicle unsafe to drive\nMakes the vehicle unsafe for any repair technicians that might work on the vehicle\nMight damage Tesla equipment, such as Superchargers\nWhen a vehicle is classified as a salvaged vehicle:\n\nAny Tesla limited warranties and extended service agreements for the vehicle are void."]
}, {
    "entity": "Menstrual cycle",
    "sentences": ["Any change in prices for your Service or any material reduction in the features of your Service will not take effect until the next monthly period of the Service has expired."]
}, {
    "entity": "Website",
    "sentences": ["We will notify you of such change by posting the amended terms on our website and/or on your Tesla Account.", "Additional Terms\nGoverning Law\nThe terms of this Agreement are governed by, and to be interpreted according to, the laws of the country in which we are licensed to sell motor vehicles that is nearest to your address that you input onto our website when placing this order."]
}, {
    "entity": "User",
    "sentences": ["Tesla may collect payment from you, including by using the credit card saved in your Tesla Account.", "You will be able to review a summary of transactions in your Tesla Account.", "We will notify you of such change by posting the amended terms on our website and/or on your Tesla Account.", "Termination, Suspension, Reactivation, Change and Transfer of Service\nSuspension or Termination\nWe can decide to either suspend or terminate the Service without warning, or issue a warning including for network or system maintenance, improvement, or failure or if we suspect your Service is being used for any unauthorized or inappropriate purpose, as a result of your breach of these Terms & Conditions or for reasons unrelated to you or your account with us.", "Cancellation by You\nYou may cancel the Service at any time through your Tesla Account or by contacting our Customer Support team and notifying us that you want to cancel the Service."]
}, {
    "entity": "Personally identifiable information",
    "sentences": ["It is your responsibility to remove all data and content (including any personal information), if any, that you may have stored on your system before you sell or transfer your Vehicle."]
}, {
    "entity": "Goods",
    "sentences": ["Your Responsibility for Maintaining Your Vehicle\nIn order for us to provide the Service, your Vehicle must be in good working order and your Vehicle must have a working electrical system and adequate battery power.", "Some examples are atmospheric, geographic, or topographic conditions (such as tall buildings, hills or tunnels), damage to or failure to maintain your Vehicle or the equipment in good working order, government laws, rules or regulations, failure, congestion or outages of utility or wireless networks (including interruption of cellular service), war, act of God, natural disaster, inclement weather, and labor strikes.", "To Tesla Motors Limited, 197 Horton Road, West Drayton UB7 8JD, United Kingdom:\nHereby I/we (*) revoke the contract concluded by me/us (*) for the purchase of the following goods (*)/the provision of the following service (*)\nOrdered on (*)/received on (*) -Name of consumer(s)\nAddress of the consumer(s)\nSignature of the consumer(s) (only in the case of paper notification)\n(*) Delete as appropriate\n\n \n\nSupercharger Fair Use Policy\n\nIntroduction\n\nWe are continually expanding our global network of Supercharger stations to enable personal long distance travel and to provide a charging solution for those without immediate access to home or workplace charging, thereby accelerating the widespread adoption of electric vehicles.", "Supercharger Fair Use\n\nTo help ensure that Superchargers are available for their intended use, unless you charge on a pay per use basis, we ask that you not charge your vehicle using a Supercharger if your vehicle is being used:\n\nas a taxi;\nfor ridesourcing or ridesharing (through Uber, Lyft or similar services);\nto commercially deliver or transport goods;\nfor government purposes; or\nfor any other commercial venture.", "Supplier Compliance\n\nTesla will do the following to ensure compliance by its suppliers with this policy as required by law and as needed:\n\nEvaluate its supply chain to address risks related to conflict minerals, human trafficking, slavery and child labor;\nAudit suppliers, to evaluate supplier compliance with Tesla's Human Rights and Conflict Minerals Policy;\nRequire direct suppliers to certify that materials incorporated into Tesla products comply with the laws regarding conflict minerals, slavery, child labor and human trafficking of the country or countries in which they are doing business;\nDiscipline employees or contractors, including potential termination of contract, who fail to meet Tesla's Human Rights and Conflict Minerals Policy;\nTrain certain Tesla employees regarding conflict minerals, human trafficking, child labor and slavery, particularly with respect to mitigating risks within the Tesla's supply chain;\nInvestigate if Tesla has a reasonable basis to believe that a Tesla supplier is engaging in human trafficking, slave or child labor, or use of conflict minerals; and\nTransition away from purchasing goods or services from any supplier that is believed to be engaging in human trafficking, slave or child labor, or use of conflict minerals if the supplier does not take corrective actions within a reasonable period of time.", "https://os.tesla.com/parrot-sources/parrot-sources.tar.gz\n\nAdditional packages:\n\nFor Autopilot and Infotainment system image sources, see:\nhttp://github.com/teslamotors/buildroot\n\nMain branch is buildroot-2019.02\nSee README.Tesla for more information on contents and configurations\nFor Autopilot and Infotainment kernel sources, see:\nhttp://github.com/teslamotors/linux\n\nbranches:\nintel-4.1: Infotainment Intel kernel\ntegra-2.6: Infotainment Tegra kernel\ntegra-4.4: Infotainment Tegra kernel\ntesla-3.18-hw2: Autopilot Nvidia kernel\ntesla-3.18-hw25: Autopilot Nvidia kernel\ntesla-4.14-hw3: Autopilot Tesla kernel\nFor Autopilot coreboot sources, see:\nhttp://github.com/teslamotors/coreboot\n\ntesla-4.6-hw3\nForthcoming releases and estimated timelines:\n\nHarman Radio module for Model 3\nPass-through source drop: Q3 2018\nCellular modem modules for Model S/X/3\nPass-through source drops: Q3 2018\nPatent Pledge\n\nOn June 12, 2014, Tesla announced that it will not initiate patent lawsuits against anyone who, in good faith, wants to use its technology.", "Tesla’s Pledge\n\nTesla irrevocably pledges that it will not initiate a lawsuit against any party for infringing a Tesla Patent through activity relating to electric vehicles or related equipment for so long as such party is acting in good faith.", "A party is \"acting in good faith\" for so long as such party and its related or affiliated companies have not:\n\nasserted, helped others assert or had a financial stake in any assertion of (i) any patent or other intellectual property right against Tesla or (ii) any patent right against a third party for its use of technologies relating to electric vehicles or related equipment;\nchallenged, helped others challenge, or had a financial stake in any challenge to any Tesla patent; or\nmarketed or sold any knock-off product (e.g., a product created by imitating or copying the design or appearance of a Tesla product or which suggests an association with or endorsement by Tesla) or provided any material assistance to another party doing so.", "In order for Tesla to preserve its ability to enforce the Tesla Patents against any party not acting in good faith, the Pledge is not a waiver of any patent claims (including claims for damages for past acts of infringement) and is not a license, covenant not to sue, or authorization to engage in patented activities or a limitation on remedies, damages or claims.", "Information We May Collect\nWe collect three main types of information related to you or your use of our products and services: \n\n(1) Information from or about you or your devices \n(2) Information from or about your Tesla vehicle \n(3) Information from or about your Tesla energy products \n\nDepending on the Tesla products and services you request, own, or use, not all of these types of information may be applicable.", "How We May Use Your Information\nWe may use information we collect to: \n\n(1) Communicate with you \n(2) Fulfill our products and services \n(3) Improve and enhance development of our products and services \n\nThis includes contacting you (or other necessary parties) to advise you of important safety-related information, to notify first responders in the event of an accident involving your vehicle, present products and offers tailored to you, or to respond to your inquiries and fulfill your requests for product information, newsletters, or other events.", "Sharing Your Information\nWe may share information with: \n\n(1) Our service providers and business partners when necessary to perform services on our or on your behalf \n(2) Third parties you authorize \n(3) Other third parties as required by law \n\nSome examples of when we may share your information include, payment processing, order fulfillment, product installation, customer service, marketing, financing, service or repair, and other similar services.", "Choice and Transparency\nWe enable you to access and control the data that we collect, use and share from or about you, or your use of our products or services, including through device permissions, in-app settings, marketing opt-outs, and disabling collection of certain vehicle data.", "In addition, neither we, any Tesla entity nor our service partners are liable (1) for our inability to contact any service partner or other party in any particular situation (including any emergency personnel), (2) for any act or omission of any other company furnishing a part of our Service or any equipment provided for such Service, (3) for errors or omissions of any vendors, dealers or manufacturers participating in offers made through us, or (4) for any damages that result from or arise out of the use, installation, repair or maintenance by you (or by any person you authorize) of the Service, or any product or service provided by or manufactured by third parties.", "Such statements are subject to risks and uncertainties, including, but not limited to: changes in currency exchange rates, interest rates and in raw material prices; introduction of competing products; increased sales incentives; and decline in resale prices of used vehicles.", "Tesla works collaboratively with our suppliers to encourage compliance with the following principles:\n\nLegal And Regulatory Compliance\n\nTesla suppliers are to ensure their operations and the products and services supplied to Tesla comply with all national and other applicable laws and regulations.", "Conflict Minerals\n\nTesla's suppliers are expected to use reasonable efforts to ensure that parts and products supplied to Tesla are DRC \"conflict-free,\" meaning that such conflict minerals do not benefit armed groups in the Democratic Republic of the Congo.", "The goal of this policy is to ensure that Tesla's products do not directly or indirectly finance or benefit armed groups through mining or mineral trading in the DRC and adjoining countries.", "Tesla does not, and will not, tolerate the use of slave or child labor in the manufacture of its products and does not, and will not, accept products or services from suppliers that engage in human trafficking in any form.", "What this pledge means is that as long as someone uses our patents for electric vehicles and doesn’t do bad things, such as knocking off our products or using our patents and then suing us for intellectual property infringement, they should have no fear of Tesla asserting its patents against them."]
}, {
    "entity": "Electricity",
    "sentences": ["Your Responsibility for Maintaining Your Vehicle\nIn order for us to provide the Service, your Vehicle must be in good working order and your Vehicle must have a working electrical system and adequate battery power.", "To Tesla Motors Limited, 197 Horton Road, West Drayton UB7 8JD, United Kingdom:\nHereby I/we (*) revoke the contract concluded by me/us (*) for the purchase of the following goods (*)/the provision of the following service (*)\nOrdered on (*)/received on (*) -Name of consumer(s)\nAddress of the consumer(s)\nSignature of the consumer(s) (only in the case of paper notification)\n(*) Delete as appropriate\n\n \n\nSupercharger Fair Use Policy\n\nIntroduction\n\nWe are continually expanding our global network of Supercharger stations to enable personal long distance travel and to provide a charging solution for those without immediate access to home or workplace charging, thereby accelerating the widespread adoption of electric vehicles.", "Tesla was created to accelerate the advent of sustainable transport, and this policy is intended to encourage the advancement of a common, rapidly-evolving platform for electric vehicles, thereby benefiting Tesla, other companies making electric vehicles, and the world.", "Tesla’s Pledge\n\nTesla irrevocably pledges that it will not initiate a lawsuit against any party for infringing a Tesla Patent through activity relating to electric vehicles or related equipment for so long as such party is acting in good faith.", "A party is \"acting in good faith\" for so long as such party and its related or affiliated companies have not:\n\nasserted, helped others assert or had a financial stake in any assertion of (i) any patent or other intellectual property right against Tesla or (ii) any patent right against a third party for its use of technologies relating to electric vehicles or related equipment;\nchallenged, helped others challenge, or had a financial stake in any challenge to any Tesla patent; or\nmarketed or sold any knock-off product (e.g., a product created by imitating or copying the design or appearance of a Tesla product or which suggests an association with or endorsement by Tesla) or provided any material assistance to another party doing so.", "What this pledge means is that as long as someone uses our patents for electric vehicles and doesn’t do bad things, such as knocking off our products or using our patents and then suing us for intellectual property infringement, they should have no fear of Tesla asserting its patents against them."]
}, {
    "entity": "Battery",
    "sentences": ["Your Responsibility for Maintaining Your Vehicle\nIn order for us to provide the Service, your Vehicle must be in good working order and your Vehicle must have a working electrical system and adequate battery power.", "Until Tesla can confirm that the vehicle is in compliance with Tesla’s safety standards and vehicle specifications, Tesla does not perform or support repairs involving the HV (high-voltage) battery systems in the vehicle because of the potential for the salvage vehicle to have sustained damage that:\n\nMakes the vehicle unsafe to drive\nMakes the vehicle unsafe for any repair technicians that might work on the vehicle\nMight damage Tesla equipment, such as Superchargers\nWhen a vehicle is classified as a salvaged vehicle:\n\nAny Tesla limited warranties and extended service agreements for the vehicle are void."]
}, {
    "entity": "Sales",
    "sentences": ["You must notify us if you sell or transfer your Vehicle or end its lease.", "It is your responsibility to remove all data and content (including any personal information), if any, that you may have stored on your system before you sell or transfer your Vehicle.", "You may not (and may not permit or cause any other party to) sell or resell or otherwise use the Service or any information provided through the Service for commercial purposes, nor may you reproduce, copy, modify, attempt to reverse engineer, make derivative works from or otherwise display or distribute information provided through the Service.", "Additional Terms\nGoverning Law\nThe terms of this Agreement are governed by, and to be interpreted according to, the laws of the country in which we are licensed to sell motor vehicles that is nearest to your address that you input onto our website when placing this order.", "Please reach out to your local sales contact to explore vehicle and charging options that suit your needs.", "Such statements are subject to risks and uncertainties, including, but not limited to: changes in currency exchange rates, interest rates and in raw material prices; introduction of competing products; increased sales incentives; and decline in resale prices of used vehicles."]
}, {
    "entity": "Information",
    "sentences": ["Privacy\n\nCustomer Privacy Notice\n\nGet to know our Privacy Notice and your choices about how information is used.", "Reference each section to get an overview of how we collect, use, share, and safeguard your information, or click learn more to expand and view the full Customer Privacy Notice.", "Information We May Collect\nWe collect three main types of information related to you or your use of our products and services: \n\n(1) Information from or about you or your devices \n(2) Information from or about your Tesla vehicle \n(3) Information from or about your Tesla energy products \n\nDepending on the Tesla products and services you request, own, or use, not all of these types of information may be applicable.", "How We May Use Your Information\nWe may use information we collect to: \n\n(1) Communicate with you \n(2) Fulfill our products and services \n(3) Improve and enhance development of our products and services \n\nThis includes contacting you (or other necessary parties) to advise you of important safety-related information, to notify first responders in the event of an accident involving your vehicle, present products and offers tailored to you, or to respond to your inquiries and fulfill your requests for product information, newsletters, or other events.", "Sharing Your Information\nWe may share information with: \n\n(1) Our service providers and business partners when necessary to perform services on our or on your behalf \n(2) Third parties you authorize \n(3) Other third parties as required by law \n\nSome examples of when we may share your information include, payment processing, order fulfillment, product installation, customer service, marketing, financing, service or repair, and other similar services.", "If we are unable to collect payment, we may contact you based on your information on file, or may request payment when we are performing services for you.", "For information on how we handle your credit card information, please see our Privacy Policy.", "The idle fee rate for each location may change from time to time, and the latest information is provided in the map pin pop-up (accessible through the navigation application on your vehicle touchscreen).", "For additional information, please see our idle fee support page.", "The pay per use billing unit and rate for each location may change from time to time, and the latest information is provided in the map pin pop-up (accessible through the navigation application on your vehicle touchscreen).", "For additional information, please see our Supercharger support page.", "It is your responsibility to remove all data and content (including any personal information), if any, that you may have stored on your system before you sell or transfer your Vehicle.", "Certain information you receive through the Service belongs to us (or other third parties) and may be subject to one or more copyrights, trademarks, service marks, patents, or other legal protections.", "You may not (and may not permit or cause any other party to) sell or resell or otherwise use the Service or any information provided through the Service for commercial purposes, nor may you reproduce, copy, modify, attempt to reverse engineer, make derivative works from or otherwise display or distribute information provided through the Service.", "These software updates and modifications may affect or erase data that you have previously stored on the equipment in your Vehicle (such as specific route or destination information).", "https://os.tesla.com/parrot-sources/parrot-sources.tar.gz\n\nAdditional packages:\n\nFor Autopilot and Infotainment system image sources, see:\nhttp://github.com/teslamotors/buildroot\n\nMain branch is buildroot-2019.02\nSee README.Tesla for more information on contents and configurations\nFor Autopilot and Infotainment kernel sources, see:\nhttp://github.com/teslamotors/linux\n\nbranches:\nintel-4.1: Infotainment Intel kernel\ntegra-2.6: Infotainment Tegra kernel\ntegra-4.4: Infotainment Tegra kernel\ntesla-3.18-hw2: Autopilot Nvidia kernel\ntesla-3.18-hw25: Autopilot Nvidia kernel\ntesla-4.14-hw3: Autopilot Tesla kernel\nFor Autopilot coreboot sources, see:\nhttp://github.com/teslamotors/coreboot\n\ntesla-4.6-hw3\nForthcoming releases and estimated timelines:\n\nHarman Radio module for Model 3\nPass-through source drop: Q3 2018\nCellular modem modules for Model S/X/3\nPass-through source drops: Q3 2018\nPatent Pledge\n\nOn June 12, 2014, Tesla announced that it will not initiate patent lawsuits against anyone who, in good faith, wants to use its technology.", "For more information about this policy, please contact a Tesla Service Center.", "No Licenses\n\nTesla, Inc. strives to achieve innovative and informative internet sites.", "Additional Terms\nGoverning Law\nThe terms of this Agreement are governed by, and to be interpreted according to, the laws of the country in which we are licensed to sell motor vehicles that is nearest to your address that you input onto our website when placing this order."]
}, {
    "entity": "Commerce",
    "sentences": ["You can withdraw your consent to receive commercial electronic messages at any time by clicking \"unsubscribe\" at the bottom of these emails or Tesla app message, or letting our customer representative know about your decision.", "You may not (and may not permit or cause any other party to) sell or resell or otherwise use the Service or any information provided through the Service for commercial purposes, nor may you reproduce, copy, modify, attempt to reverse engineer, make derivative works from or otherwise display or distribute information provided through the Service.", "Supercharger Fair Use\n\nTo help ensure that Superchargers are available for their intended use, unless you charge on a pay per use basis, we ask that you not charge your vehicle using a Supercharger if your vehicle is being used:\n\nas a taxi;\nfor ridesourcing or ridesharing (through Uber, Lyft or similar services);\nto commercially deliver or transport goods;\nfor government purposes; or\nfor any other commercial venture.", "These objects may not be copied for commercial use or distribution, nor may these objects be modified or reposted.", "Sharing Your Information\nWe may share information with: \n\n(1) Our service providers and business partners when necessary to perform services on our or on your behalf \n(2) Third parties you authorize \n(3) Other third parties as required by law \n\nSome examples of when we may share your information include, payment processing, order fulfillment, product installation, customer service, marketing, financing, service or repair, and other similar services.", "Supplier Compliance\n\nTesla will do the following to ensure compliance by its suppliers with this policy as required by law and as needed:\n\nEvaluate its supply chain to address risks related to conflict minerals, human trafficking, slavery and child labor;\nAudit suppliers, to evaluate supplier compliance with Tesla's Human Rights and Conflict Minerals Policy;\nRequire direct suppliers to certify that materials incorporated into Tesla products comply with the laws regarding conflict minerals, slavery, child labor and human trafficking of the country or countries in which they are doing business;\nDiscipline employees or contractors, including potential termination of contract, who fail to meet Tesla's Human Rights and Conflict Minerals Policy;\nTrain certain Tesla employees regarding conflict minerals, human trafficking, child labor and slavery, particularly with respect to mitigating risks within the Tesla's supply chain;\nInvestigate if Tesla has a reasonable basis to believe that a Tesla supplier is engaging in human trafficking, slave or child labor, or use of conflict minerals; and\nTransition away from purchasing goods or services from any supplier that is believed to be engaging in human trafficking, slave or child labor, or use of conflict minerals if the supplier does not take corrective actions within a reasonable period of time.", "The Company has a consistent process in place to identify, manage and mitigate exposure to issues that may have a negative impact on the business.", "The Company works closely with external advisors to ensure tax risks are adequately managed and that the Company remains up to date with the latest tax changes that may affect the business.", "However, given the scale of Tesla’s business and the complexity of tax legislation, it is inevitable that tax risks will arise.", "Certain information you receive through the Service belongs to us (or other third parties) and may be subject to one or more copyrights, trademarks, service marks, patents, or other legal protections.", "However, Tesla, Inc. must protect its intellectual property, including its patents, trademarks and copyrights."]
}, {
    "entity": "Photocopier",
    "sentences": ["Certain information you receive through the Service belongs to us (or other third parties) and may be subject to one or more copyrights, trademarks, service marks, patents, or other legal protections.", "You may not (and may not permit or cause any other party to) sell or resell or otherwise use the Service or any information provided through the Service for commercial purposes, nor may you reproduce, copy, modify, attempt to reverse engineer, make derivative works from or otherwise display or distribute information provided through the Service.", "However, Tesla, Inc. must protect its intellectual property, including its patents, trademarks and copyrights.", "A party is \"acting in good faith\" for so long as such party and its related or affiliated companies have not:\n\nasserted, helped others assert or had a financial stake in any assertion of (i) any patent or other intellectual property right against Tesla or (ii) any patent right against a third party for its use of technologies relating to electric vehicles or related equipment;\nchallenged, helped others challenge, or had a financial stake in any challenge to any Tesla patent; or\nmarketed or sold any knock-off product (e.g., a product created by imitating or copying the design or appearance of a Tesla product or which suggests an association with or endorsement by Tesla) or provided any material assistance to another party doing so."]
}, {
    "entity": "Software",
    "sentences": ["The Service may not work if you try to modify or add any equipment or software in or to your Vehicle that is not expressly authorized by us or is not compatible with the Service.", "We own or have rights to all such software and you do not acquire any rights in such software other than the right to use such software as reasonably necessary for you to use the Service as permitted in your Terms & Conditions.", "We may update or modify the software contained in your Vehicle from time to time, and we may do this remotely without notifying you or seeking your consent.", "These software updates and modifications may affect or erase data that you have previously stored on the equipment in your Vehicle (such as specific route or destination information).", "You understand that software available is dependent on vehicle configuration and geographical region, which may affect your access to the Service and/or any of its features."]
}, {
    "entity": "Advertising",
    "sentences": ["You can withdraw your consent to receive commercial electronic messages at any time by clicking \"unsubscribe\" at the bottom of these emails or Tesla app message, or letting our customer representative know about your decision.", "You may not (and may not permit or cause any other party to) sell or resell or otherwise use the Service or any information provided through the Service for commercial purposes, nor may you reproduce, copy, modify, attempt to reverse engineer, make derivative works from or otherwise display or distribute information provided through the Service.", "Supercharger Fair Use\n\nTo help ensure that Superchargers are available for their intended use, unless you charge on a pay per use basis, we ask that you not charge your vehicle using a Supercharger if your vehicle is being used:\n\nas a taxi;\nfor ridesourcing or ridesharing (through Uber, Lyft or similar services);\nto commercially deliver or transport goods;\nfor government purposes; or\nfor any other commercial venture.", "These objects may not be copied for commercial use or distribution, nor may these objects be modified or reposted."]
}, {
    "entity": "Reverse engineering",
    "sentences": ["You may not (and may not permit or cause any other party to) sell or resell or otherwise use the Service or any information provided through the Service for commercial purposes, nor may you reproduce, copy, modify, attempt to reverse engineer, make derivative works from or otherwise display or distribute information provided through the Service."]
}, {
    "entity": "Derivative work",
    "sentences": ["You may not (and may not permit or cause any other party to) sell or resell or otherwise use the Service or any information provided through the Service for commercial purposes, nor may you reproduce, copy, modify, attempt to reverse engineer, make derivative works from or otherwise display or distribute information provided through the Service.", "Conflict-free means such parts and supplies do not contain metals derived from \"conflict minerals\" which are defined as:\n\n(i)\tcolumbite-tantalite (tantalum);\n(ii)\tcassiterite (tin);\n(iii)\tgold;\n(iv)\twolframite (tungsten); and\n(v)\tany derivatives of the above."]
}, {
    "entity": "Liability",
    "sentences": ["In addition, neither we, any Tesla entity nor our service partners are liable (1) for our inability to contact any service partner or other party in any particular situation (including any emergency personnel), (2) for any act or omission of any other company furnishing a part of our Service or any equipment provided for such Service, (3) for errors or omissions of any vendors, dealers or manufacturers participating in offers made through us, or (4) for any damages that result from or arise out of the use, installation, repair or maintenance by you (or by any person you authorize) of the Service, or any product or service provided by or manufactured by third parties.", "Tesla shall be liable without limitation under the Agreement for damages resulting from intentional or negligent injury to life, body or health and for other damages resulting from intentional or grossly negligent conduct by Tesla or its legal representatives or agents.", "Unless Tesla has unlimited liability under the provisions of the previous paragraph, in case of a breach of a material contractual obligation due to ordinary negligence, Tesla's liability for damages or reimbursement of expenses shall be limited to typically foreseeable damages.", "You agree that the limitations of liability and indemnities in these Terms & Conditions will survive even after your Service has terminated."]
}, {
    "entity": "Statute of limitations",
    "sentences": ["Tesla shall be liable without limitation under the Agreement for damages resulting from intentional or negligent injury to life, body or health and for other damages resulting from intentional or grossly negligent conduct by Tesla or its legal representatives or agents.", "You agree that the limitations of liability and indemnities in these Terms & Conditions will survive even after your Service has terminated.", "We are not responsible for any statements, agreements, representations, warranties or covenants, oral or written, including, without limitation, any statements from third parties, concerning or relating to the Service provided to you pursuant to these Terms & Conditions, unless such statements, agreements, representations warranties or covenants are expressly contained in or incorporate by these Terms & Conditions.", "In order for Tesla to preserve its ability to enforce the Tesla Patents against any party not acting in good faith, the Pledge is not a waiver of any patent claims (including claims for damages for past acts of infringement) and is not a license, covenant not to sue, or authorization to engage in patented activities or a limitation on remedies, damages or claims."]
}, {
    "entity": "Damages",
    "sentences": ["In addition, neither we, any Tesla entity nor our service partners are liable (1) for our inability to contact any service partner or other party in any particular situation (including any emergency personnel), (2) for any act or omission of any other company furnishing a part of our Service or any equipment provided for such Service, (3) for errors or omissions of any vendors, dealers or manufacturers participating in offers made through us, or (4) for any damages that result from or arise out of the use, installation, repair or maintenance by you (or by any person you authorize) of the Service, or any product or service provided by or manufactured by third parties.", "Tesla shall be liable without limitation under the Agreement for damages resulting from intentional or negligent injury to life, body or health and for other damages resulting from intentional or grossly negligent conduct by Tesla or its legal representatives or agents.", "Unless Tesla has unlimited liability under the provisions of the previous paragraph, in case of a breach of a material contractual obligation due to ordinary negligence, Tesla's liability for damages or reimbursement of expenses shall be limited to typically foreseeable damages.", "In order for Tesla to preserve its ability to enforce the Tesla Patents against any party not acting in good faith, the Pledge is not a waiver of any patent claims (including claims for damages for past acts of infringement) and is not a license, covenant not to sue, or authorization to engage in patented activities or a limitation on remedies, damages or claims."]
}, {
    "entity": "Intent",
    "sentences": ["Tesla shall be liable without limitation under the Agreement for damages resulting from intentional or negligent injury to life, body or health and for other damages resulting from intentional or grossly negligent conduct by Tesla or its legal representatives or agents."]
}, {
    "entity": "Trauma",
    "sentences": ["Tesla shall be liable without limitation under the Agreement for damages resulting from intentional or negligent injury to life, body or health and for other damages resulting from intentional or grossly negligent conduct by Tesla or its legal representatives or agents."]
}, {
    "entity": "Gross negligence",
    "sentences": ["Tesla shall be liable without limitation under the Agreement for damages resulting from intentional or negligent injury to life, body or health and for other damages resulting from intentional or grossly negligent conduct by Tesla or its legal representatives or agents.", "Unless Tesla has unlimited liability under the provisions of the previous paragraph, in case of a breach of a material contractual obligation due to ordinary negligence, Tesla's liability for damages or reimbursement of expenses shall be limited to typically foreseeable damages."]
}, {
    "entity": "Behavior",
    "sentences": ["Tesla shall be liable without limitation under the Agreement for damages resulting from intentional or negligent injury to life, body or health and for other damages resulting from intentional or grossly negligent conduct by Tesla or its legal representatives or agents.", "Policy\n\nHuman Rights And Conflict Minerals Policy\n\nTesla expects our suppliers to conduct their worldwide operations in responsible manner in adherence of this policy and the principles enumerated herein.", "Tesla Conflict Minerals Report\n\nDownload PDF\n\nLast Updated May 2020\n\nTesla Supplier Code of Conduct\n\nDownload PDF\n\nLast Updated June 2017\n\nTesla UK Modern Slavery Act Transparency Statement\n\nDownload 2019 Report PDF\n\nLast Updated June 2020\n\nDownload 2018 Report PDF\n\nDownload 2017 Report PDF\n\nDownload 2016 Report PDF\n\nUnsupported or Salvaged Vehicle Policy\n\nAn unsupported or salvaged vehicle is a vehicle that has been declared a total loss, commonly after extensive damage caused by a crash, flooding, fire, or similar hazard, and has been (or qualifies to be) registered and/or titled by its owner as a salvaged vehicle or its equivalent pursuant to local jurisdiction or industry practice.", "If you charge your vehicle in a manner that does not comply with this Supercharger Fair Use Policy, we may ask you to modify this behavior."]
}, {
    "entity": "Law",
    "sentences": ["Tesla, Inc\nAttn: Legal,\n45500 Fremont Boulevard\nFremont, CA 94538\n(650) 681-5000\n\nTerms of Use\n\nPayment Terms for Services\nPremium Connectivity\nRevocation Policy\nSupercharger Fair Use Policy\nTesla Intellectual Property\nPayment Terms for Services\n\nThese Terms of Service describe your agreement to pay for future services and charges.", "Certain information you receive through the Service belongs to us (or other third parties) and may be subject to one or more copyrights, trademarks, service marks, patents, or other legal protections.", "In the event of any regulatory, governmental or other legally-compelled changes, or discontinuation or change of necessary telecommunications systems and services (e.g., if our Wireless Service Provider terminates or restricts wireless services of the type used by your Vehicle’s equipment), you are solely responsible for replacing, as well as the cost of replacing, any equipment that is necessitated as a result of such change or discontinuation, except that if such change occurs during your Vehicle’s base warranty period, while you will still be responsible for the cost of such replacement, we will be responsible for obtaining and providing you with the necessary replacement materials (if applicable).", "Tesla shall be liable without limitation under the Agreement for damages resulting from intentional or negligent injury to life, body or health and for other damages resulting from intentional or grossly negligent conduct by Tesla or its legal representatives or agents.", "Tesla works collaboratively with our suppliers to encourage compliance with the following principles:\n\nLegal And Regulatory Compliance\n\nTesla suppliers are to ensure their operations and the products and services supplied to Tesla comply with all national and other applicable laws and regulations.", "You may also provide comments or report concerns by email to: legal@tesla.com.", "A list of Tesla Patents subject to the Pledge will be maintained at the following URL: https://www.tesla.com/about/legal#patent-list.", "Sharing Your Information\nWe may share information with: \n\n(1) Our service providers and business partners when necessary to perform services on our or on your behalf \n(2) Third parties you authorize \n(3) Other third parties as required by law \n\nSome examples of when we may share your information include, payment processing, order fulfillment, product installation, customer service, marketing, financing, service or repair, and other similar services.", "Charges may include taxes as required by law.", "Some examples are atmospheric, geographic, or topographic conditions (such as tall buildings, hills or tunnels), damage to or failure to maintain your Vehicle or the equipment in good working order, government laws, rules or regulations, failure, congestion or outages of utility or wireless networks (including interruption of cellular service), war, act of God, natural disaster, inclement weather, and labor strikes.", "Additional Terms\nGoverning Law\nThe terms of this Agreement are governed by, and to be interpreted according to, the laws of the country in which we are licensed to sell motor vehicles that is nearest to your address that you input onto our website when placing this order.", "Supplier Compliance\n\nTesla will do the following to ensure compliance by its suppliers with this policy as required by law and as needed:\n\nEvaluate its supply chain to address risks related to conflict minerals, human trafficking, slavery and child labor;\nAudit suppliers, to evaluate supplier compliance with Tesla's Human Rights and Conflict Minerals Policy;\nRequire direct suppliers to certify that materials incorporated into Tesla products comply with the laws regarding conflict minerals, slavery, child labor and human trafficking of the country or countries in which they are doing business;\nDiscipline employees or contractors, including potential termination of contract, who fail to meet Tesla's Human Rights and Conflict Minerals Policy;\nTrain certain Tesla employees regarding conflict minerals, human trafficking, child labor and slavery, particularly with respect to mitigating risks within the Tesla's supply chain;\nInvestigate if Tesla has a reasonable basis to believe that a Tesla supplier is engaging in human trafficking, slave or child labor, or use of conflict minerals; and\nTransition away from purchasing goods or services from any supplier that is believed to be engaging in human trafficking, slave or child labor, or use of conflict minerals if the supplier does not take corrective actions within a reasonable period of time.", "https://os.tesla.com/parrot-sources/parrot-sources.tar.gz\n\nAdditional packages:\n\nFor Autopilot and Infotainment system image sources, see:\nhttp://github.com/teslamotors/buildroot\n\nMain branch is buildroot-2019.02\nSee README.Tesla for more information on contents and configurations\nFor Autopilot and Infotainment kernel sources, see:\nhttp://github.com/teslamotors/linux\n\nbranches:\nintel-4.1: Infotainment Intel kernel\ntegra-2.6: Infotainment Tegra kernel\ntegra-4.4: Infotainment Tegra kernel\ntesla-3.18-hw2: Autopilot Nvidia kernel\ntesla-3.18-hw25: Autopilot Nvidia kernel\ntesla-4.14-hw3: Autopilot Tesla kernel\nFor Autopilot coreboot sources, see:\nhttp://github.com/teslamotors/coreboot\n\ntesla-4.6-hw3\nForthcoming releases and estimated timelines:\n\nHarman Radio module for Model 3\nPass-through source drop: Q3 2018\nCellular modem modules for Model S/X/3\nPass-through source drops: Q3 2018\nPatent Pledge\n\nOn June 12, 2014, Tesla announced that it will not initiate patent lawsuits against anyone who, in good faith, wants to use its technology.", "Tesla’s Pledge\n\nTesla irrevocably pledges that it will not initiate a lawsuit against any party for infringing a Tesla Patent through activity relating to electric vehicles or related equipment for so long as such party is acting in good faith.", "Approach to risk management and governance in relation to UK taxation\n\nTesla is committed to being a responsible taxpayer and to comply with the tax laws and regulations in all the jurisdictions in which the Company operates, including the United Kingdom."]
}, {
    "entity": "Consent",
    "sentences": ["You can withdraw your consent to receive commercial electronic messages at any time by clicking \"unsubscribe\" at the bottom of these emails or Tesla app message, or letting our customer representative know about your decision.", "We may update or modify the software contained in your Vehicle from time to time, and we may do this remotely without notifying you or seeking your consent."]
}, {
    "entity": "Mobile app",
    "sentences": ["Information We May Collect\nWe collect three main types of information related to you or your use of our products and services: \n\n(1) Information from or about you or your devices \n(2) Information from or about your Tesla vehicle \n(3) Information from or about your Tesla energy products \n\nDepending on the Tesla products and services you request, own, or use, not all of these types of information may be applicable.", "Choice and Transparency\nWe enable you to access and control the data that we collect, use and share from or about you, or your use of our products or services, including through device permissions, in-app settings, marketing opt-outs, and disabling collection of certain vehicle data.", "You can withdraw your consent to receive commercial electronic messages at any time by clicking \"unsubscribe\" at the bottom of these emails or Tesla app message, or letting our customer representative know about your decision.", "To avoid idle fees, we recommend you monitor your vehicle while using a Supercharger and encourage you to use the Tesla mobile app to track your vehicle's charge status.", "The idle fee rate for each location may change from time to time, and the latest information is provided in the map pin pop-up (accessible through the navigation application on your vehicle touchscreen).", "The pay per use billing unit and rate for each location may change from time to time, and the latest information is provided in the map pin pop-up (accessible through the navigation application on your vehicle touchscreen).", "If you do not cancel your Service prior to the applicable effective date of the changes, your Service will be modified to reflect the applicable change to prices and/or features charged for your Service.", "We will automatically debit your monthly payment from this credit card on the monthly anniversary of the effective date of this Agreement unless you cancel your Service before the applicable day of renewal.", "All charges will be charged in advance of the term to which they apply.", "Termination, Suspension, Reactivation, Change and Transfer of Service\nSuspension or Termination\nWe can decide to either suspend or terminate the Service without warning, or issue a warning including for network or system maintenance, improvement, or failure or if we suspect your Service is being used for any unauthorized or inappropriate purpose, as a result of your breach of these Terms & Conditions or for reasons unrelated to you or your account with us.", "In the event of any regulatory, governmental or other legally-compelled changes, or discontinuation or change of necessary telecommunications systems and services (e.g., if our Wireless Service Provider terminates or restricts wireless services of the type used by your Vehicle’s equipment), you are solely responsible for replacing, as well as the cost of replacing, any equipment that is necessitated as a result of such change or discontinuation, except that if such change occurs during your Vehicle’s base warranty period, while you will still be responsible for the cost of such replacement, we will be responsible for obtaining and providing you with the necessary replacement materials (if applicable).", "To Tesla Motors Limited, 197 Horton Road, West Drayton UB7 8JD, United Kingdom:\nHereby I/we (*) revoke the contract concluded by me/us (*) for the purchase of the following goods (*)/the provision of the following service (*)\nOrdered on (*)/received on (*) -Name of consumer(s)\nAddress of the consumer(s)\nSignature of the consumer(s) (only in the case of paper notification)\n(*) Delete as appropriate\n\n \n\nSupercharger Fair Use Policy\n\nIntroduction\n\nWe are continually expanding our global network of Supercharger stations to enable personal long distance travel and to provide a charging solution for those without immediate access to home or workplace charging, thereby accelerating the widespread adoption of electric vehicles.", "Tesla works collaboratively with our suppliers to encourage compliance with the following principles:\n\nLegal And Regulatory Compliance\n\nTesla suppliers are to ensure their operations and the products and services supplied to Tesla comply with all national and other applicable laws and regulations.", "A party is \"acting in good faith\" for so long as such party and its related or affiliated companies have not:\n\nasserted, helped others assert or had a financial stake in any assertion of (i) any patent or other intellectual property right against Tesla or (ii) any patent right against a third party for its use of technologies relating to electric vehicles or related equipment;\nchallenged, helped others challenge, or had a financial stake in any challenge to any Tesla patent; or\nmarketed or sold any knock-off product (e.g., a product created by imitating or copying the design or appearance of a Tesla product or which suggests an association with or endorsement by Tesla) or provided any material assistance to another party doing so.", "Approach to risk management and governance in relation to UK taxation\n\nTesla is committed to being a responsible taxpayer and to comply with the tax laws and regulations in all the jurisdictions in which the Company operates, including the United Kingdom.", "The Company has a low risk appetite in respect of taxation and seeks to minimize the risk of uncertainty or disputes."]
}, {
    "entity": "Customer representative",
    "sentences": ["You can withdraw your consent to receive commercial electronic messages at any time by clicking \"unsubscribe\" at the bottom of these emails or Tesla app message, or letting our customer representative know about your decision."]
}, {
    "entity": "Payment processor",
    "sentences": ["Sharing Your Information\nWe may share information with: \n\n(1) Our service providers and business partners when necessary to perform services on our or on your behalf \n(2) Third parties you authorize \n(3) Other third parties as required by law \n\nSome examples of when we may share your information include, payment processing, order fulfillment, product installation, customer service, marketing, financing, service or repair, and other similar services."]
}, {
    "entity": "Order fulfillment",
    "sentences": ["Sharing Your Information\nWe may share information with: \n\n(1) Our service providers and business partners when necessary to perform services on our or on your behalf \n(2) Third parties you authorize \n(3) Other third parties as required by law \n\nSome examples of when we may share your information include, payment processing, order fulfillment, product installation, customer service, marketing, financing, service or repair, and other similar services.", "Material contractual obligations are obligations whose fulfilment is essential for the proper execution of the Agreement and on whose fulfilment you regularly rely and may rely (cardinal obligations)."]
}, {
    "entity": "Product",
    "sentences": ["Information We May Collect\nWe collect three main types of information related to you or your use of our products and services: \n\n(1) Information from or about you or your devices \n(2) Information from or about your Tesla vehicle \n(3) Information from or about your Tesla energy products \n\nDepending on the Tesla products and services you request, own, or use, not all of these types of information may be applicable.", "How We May Use Your Information\nWe may use information we collect to: \n\n(1) Communicate with you \n(2) Fulfill our products and services \n(3) Improve and enhance development of our products and services \n\nThis includes contacting you (or other necessary parties) to advise you of important safety-related information, to notify first responders in the event of an accident involving your vehicle, present products and offers tailored to you, or to respond to your inquiries and fulfill your requests for product information, newsletters, or other events.", "Sharing Your Information\nWe may share information with: \n\n(1) Our service providers and business partners when necessary to perform services on our or on your behalf \n(2) Third parties you authorize \n(3) Other third parties as required by law \n\nSome examples of when we may share your information include, payment processing, order fulfillment, product installation, customer service, marketing, financing, service or repair, and other similar services.", "Choice and Transparency\nWe enable you to access and control the data that we collect, use and share from or about you, or your use of our products or services, including through device permissions, in-app settings, marketing opt-outs, and disabling collection of certain vehicle data.", "In addition, neither we, any Tesla entity nor our service partners are liable (1) for our inability to contact any service partner or other party in any particular situation (including any emergency personnel), (2) for any act or omission of any other company furnishing a part of our Service or any equipment provided for such Service, (3) for errors or omissions of any vendors, dealers or manufacturers participating in offers made through us, or (4) for any damages that result from or arise out of the use, installation, repair or maintenance by you (or by any person you authorize) of the Service, or any product or service provided by or manufactured by third parties.", "Such statements are subject to risks and uncertainties, including, but not limited to: changes in currency exchange rates, interest rates and in raw material prices; introduction of competing products; increased sales incentives; and decline in resale prices of used vehicles.", "Tesla works collaboratively with our suppliers to encourage compliance with the following principles:\n\nLegal And Regulatory Compliance\n\nTesla suppliers are to ensure their operations and the products and services supplied to Tesla comply with all national and other applicable laws and regulations.", "Conflict Minerals\n\nTesla's suppliers are expected to use reasonable efforts to ensure that parts and products supplied to Tesla are DRC \"conflict-free,\" meaning that such conflict minerals do not benefit armed groups in the Democratic Republic of the Congo.", "The goal of this policy is to ensure that Tesla's products do not directly or indirectly finance or benefit armed groups through mining or mineral trading in the DRC and adjoining countries.", "Tesla does not, and will not, tolerate the use of slave or child labor in the manufacture of its products and does not, and will not, accept products or services from suppliers that engage in human trafficking in any form.", "Supplier Compliance\n\nTesla will do the following to ensure compliance by its suppliers with this policy as required by law and as needed:\n\nEvaluate its supply chain to address risks related to conflict minerals, human trafficking, slavery and child labor;\nAudit suppliers, to evaluate supplier compliance with Tesla's Human Rights and Conflict Minerals Policy;\nRequire direct suppliers to certify that materials incorporated into Tesla products comply with the laws regarding conflict minerals, slavery, child labor and human trafficking of the country or countries in which they are doing business;\nDiscipline employees or contractors, including potential termination of contract, who fail to meet Tesla's Human Rights and Conflict Minerals Policy;\nTrain certain Tesla employees regarding conflict minerals, human trafficking, child labor and slavery, particularly with respect to mitigating risks within the Tesla's supply chain;\nInvestigate if Tesla has a reasonable basis to believe that a Tesla supplier is engaging in human trafficking, slave or child labor, or use of conflict minerals; and\nTransition away from purchasing goods or services from any supplier that is believed to be engaging in human trafficking, slave or child labor, or use of conflict minerals if the supplier does not take corrective actions within a reasonable period of time.", "A party is \"acting in good faith\" for so long as such party and its related or affiliated companies have not:\n\nasserted, helped others assert or had a financial stake in any assertion of (i) any patent or other intellectual property right against Tesla or (ii) any patent right against a third party for its use of technologies relating to electric vehicles or related equipment;\nchallenged, helped others challenge, or had a financial stake in any challenge to any Tesla patent; or\nmarketed or sold any knock-off product (e.g., a product created by imitating or copying the design or appearance of a Tesla product or which suggests an association with or endorsement by Tesla) or provided any material assistance to another party doing so.", "What this pledge means is that as long as someone uses our patents for electric vehicles and doesn’t do bad things, such as knocking off our products or using our patents and then suing us for intellectual property infringement, they should have no fear of Tesla asserting its patents against them."]
}, {
    "entity": "Customer service",
    "sentences": ["Sharing Your Information\nWe may share information with: \n\n(1) Our service providers and business partners when necessary to perform services on our or on your behalf \n(2) Third parties you authorize \n(3) Other third parties as required by law \n\nSome examples of when we may share your information include, payment processing, order fulfillment, product installation, customer service, marketing, financing, service or repair, and other similar services.", "Information We May Collect\nWe collect three main types of information related to you or your use of our products and services: \n\n(1) Information from or about you or your devices \n(2) Information from or about your Tesla vehicle \n(3) Information from or about your Tesla energy products \n\nDepending on the Tesla products and services you request, own, or use, not all of these types of information may be applicable.", "How We May Use Your Information\nWe may use information we collect to: \n\n(1) Communicate with you \n(2) Fulfill our products and services \n(3) Improve and enhance development of our products and services \n\nThis includes contacting you (or other necessary parties) to advise you of important safety-related information, to notify first responders in the event of an accident involving your vehicle, present products and offers tailored to you, or to respond to your inquiries and fulfill your requests for product information, newsletters, or other events.", "Choice and Transparency\nWe enable you to access and control the data that we collect, use and share from or about you, or your use of our products or services, including through device permissions, in-app settings, marketing opt-outs, and disabling collection of certain vehicle data.", "How to Contact Us\nFor questions or comments, to opt out from certain services, or to submit a data privacy request, please contact us.", "Tesla, Inc\nAttn: Legal,\n45500 Fremont Boulevard\nFremont, CA 94538\n(650) 681-5000\n\nTerms of Use\n\nPayment Terms for Services\nPremium Connectivity\nRevocation Policy\nSupercharger Fair Use Policy\nTesla Intellectual Property\nPayment Terms for Services\n\nThese Terms of Service describe your agreement to pay for future services and charges.", "The services or charges described below may result in charges to you, even if someone else is using your vehicle.", "If we are unable to collect payment, we may contact you based on your information on file, or may request payment when we are performing services for you.", "If you do not pay past due amounts we may limit or block your vehicle's ability to use the related services until payment issues are resolved.", "Changes to Terms & Conditions\nWe can change these Terms & Conditions; change, add or delete Services or the features included therein; and change the prices we charge for the Service, at any time.", "Any change in prices for your Service or any material reduction in the features of your Service will not take effect until the next monthly period of the Service has expired.", "If you do not cancel your Service prior to the applicable effective date of the changes, your Service will be modified to reflect the applicable change to prices and/or features charged for your Service.", "Payment Provisions\nThird Party Charges\nYou are responsible for paying directly to third parties all charges for services furnished by them directly to you that are not expressly covered by your Service.", "We will automatically debit your monthly payment from this credit card on the monthly anniversary of the effective date of this Agreement unless you cancel your Service before the applicable day of renewal.", "We may terminate or suspend your Service without notice to you, if your credit, charge or debit card provider refuses a charge from us or if such card has otherwise expired.", "Even if we terminate or suspend your Service, you will still be responsible for any charges due at the time of such suspension or termination.", "Termination, Suspension, Reactivation, Change and Transfer of Service\nSuspension or Termination\nWe can decide to either suspend or terminate the Service without warning, or issue a warning including for network or system maintenance, improvement, or failure or if we suspect your Service is being used for any unauthorized or inappropriate purpose, as a result of your breach of these Terms & Conditions or for reasons unrelated to you or your account with us.", "If suspension or termination of the Service occurs for any reason, you acknowledge and agree that you may not be able to access the Service.", "If we elect to terminate your Service, you will be entitled to a pro rata refund or credit of the prepaid charges determined on the remaining monthly term of the Service.", "Cancellation by You\nYou may cancel the Service at any time through your Tesla Account or by contacting our Customer Support team and notifying us that you want to cancel the Service.", "If you cancel, your cancelation of the Service will only be effective from the end of the current monthly subscription term.", "Reactivation of Service\nYou do not have any right to have your Service reactivated, even if you cure any of the issues that resulted in the termination or suspension of your Service.", "It is solely our decision as to whether to allow you to have Service again.", "If we do decide to reactivate your Service, we have the right to charge a reactivation fee.", "If you fail to notify us, you will remain responsible for all charges for any Service incurred in connection with such Vehicle.", "Your Responsibility for Maintaining Your Vehicle\nIn order for us to provide the Service, your Vehicle must be in good working order and your Vehicle must have a working electrical system and adequate battery power.", "The Service may not work if you try to modify or add any equipment or software in or to your Vehicle that is not expressly authorized by us or is not compatible with the Service.", "Certain information you receive through the Service belongs to us (or other third parties) and may be subject to one or more copyrights, trademarks, service marks, patents, or other legal protections.", "You may not (and may not permit or cause any other party to) sell or resell or otherwise use the Service or any information provided through the Service for commercial purposes, nor may you reproduce, copy, modify, attempt to reverse engineer, make derivative works from or otherwise display or distribute information provided through the Service.", "Events Beyond Our Control\nVarious conditions beyond our control may prevent or delay us from providing Service to you, or affect the quality of the Service.", "Some examples are atmospheric, geographic, or topographic conditions (such as tall buildings, hills or tunnels), damage to or failure to maintain your Vehicle or the equipment in good working order, government laws, rules or regulations, failure, congestion or outages of utility or wireless networks (including interruption of cellular service), war, act of God, natural disaster, inclement weather, and labor strikes.", "In the event of any regulatory, governmental or other legally-compelled changes, or discontinuation or change of necessary telecommunications systems and services (e.g., if our Wireless Service Provider terminates or restricts wireless services of the type used by your Vehicle’s equipment), you are solely responsible for replacing, as well as the cost of replacing, any equipment that is necessitated as a result of such change or discontinuation, except that if such change occurs during your Vehicle’s base warranty period, while you will still be responsible for the cost of such replacement, we will be responsible for obtaining and providing you with the necessary replacement materials (if applicable).", "Disclaimer of Warranties\nTESLA DOES NOT WARRANT OR GUARANTEE THAT SERVICE WILL BE AVAILABLE AT ANY SPECIFIC TIME OR AT ALL TIMES OR TO ANY GEOGRAPHIC LOCATION, OR THAT THE SERVICE WILL BE PROVIDED WITHOUT INTERRUPTION, DELAY OR ERROR.", "Such warranty does not cover the Service, in whole or in part.", "In addition, neither we, any Tesla entity nor our service partners are liable (1) for our inability to contact any service partner or other party in any particular situation (including any emergency personnel), (2) for any act or omission of any other company furnishing a part of our Service or any equipment provided for such Service, (3) for errors or omissions of any vendors, dealers or manufacturers participating in offers made through us, or (4) for any damages that result from or arise out of the use, installation, repair or maintenance by you (or by any person you authorize) of the Service, or any product or service provided by or manufactured by third parties.", "In these cases, if you experience problems or dissatisfaction with the Service, your sole and exclusive remedy is to cancel the Service and discontinue using the Service.", "You agree that the limitations of liability and indemnities in these Terms & Conditions will survive even after your Service has terminated.", "We own or have rights to all such software and you do not acquire any rights in such software other than the right to use such software as reasonably necessary for you to use the Service as permitted in your Terms & Conditions.", "We are not responsible for any lost or erased (or otherwise affected) data and you are solely responsible for the data that you may have downloaded, uploaded, transmitted or otherwise stored from, to, on or through the equipment or Service.", "You understand that software available is dependent on vehicle configuration and geographical region, which may affect your access to the Service and/or any of its features.", "We are not responsible for any statements, agreements, representations, warranties or covenants, oral or written, including, without limitation, any statements from third parties, concerning or relating to the Service provided to you pursuant to these Terms & Conditions, unless such statements, agreements, representations warranties or covenants are expressly contained in or incorporate by these Terms & Conditions.", "Survivorship\nEven after your Service has ended and unless it has been replaced by a new agreement expressly entered into by and between us, the provisions of these Terms & Conditions shall survive.", "To Tesla Motors Limited, 197 Horton Road, West Drayton UB7 8JD, United Kingdom:\nHereby I/we (*) revoke the contract concluded by me/us (*) for the purchase of the following goods (*)/the provision of the following service (*)\nOrdered on (*)/received on (*) -Name of consumer(s)\nAddress of the consumer(s)\nSignature of the consumer(s) (only in the case of paper notification)\n(*) Delete as appropriate\n\n \n\nSupercharger Fair Use Policy\n\nIntroduction\n\nWe are continually expanding our global network of Supercharger stations to enable personal long distance travel and to provide a charging solution for those without immediate access to home or workplace charging, thereby accelerating the widespread adoption of electric vehicles.", "Supercharger Fair Use\n\nTo help ensure that Superchargers are available for their intended use, unless you charge on a pay per use basis, we ask that you not charge your vehicle using a Supercharger if your vehicle is being used:\n\nas a taxi;\nfor ridesourcing or ridesharing (through Uber, Lyft or similar services);\nto commercially deliver or transport goods;\nfor government purposes; or\nfor any other commercial venture.", "Tesla works collaboratively with our suppliers to encourage compliance with the following principles:\n\nLegal And Regulatory Compliance\n\nTesla suppliers are to ensure their operations and the products and services supplied to Tesla comply with all national and other applicable laws and regulations.", "Tesla does not, and will not, tolerate the use of slave or child labor in the manufacture of its products and does not, and will not, accept products or services from suppliers that engage in human trafficking in any form.", "Supplier Compliance\n\nTesla will do the following to ensure compliance by its suppliers with this policy as required by law and as needed:\n\nEvaluate its supply chain to address risks related to conflict minerals, human trafficking, slavery and child labor;\nAudit suppliers, to evaluate supplier compliance with Tesla's Human Rights and Conflict Minerals Policy;\nRequire direct suppliers to certify that materials incorporated into Tesla products comply with the laws regarding conflict minerals, slavery, child labor and human trafficking of the country or countries in which they are doing business;\nDiscipline employees or contractors, including potential termination of contract, who fail to meet Tesla's Human Rights and Conflict Minerals Policy;\nTrain certain Tesla employees regarding conflict minerals, human trafficking, child labor and slavery, particularly with respect to mitigating risks within the Tesla's supply chain;\nInvestigate if Tesla has a reasonable basis to believe that a Tesla supplier is engaging in human trafficking, slave or child labor, or use of conflict minerals; and\nTransition away from purchasing goods or services from any supplier that is believed to be engaging in human trafficking, slave or child labor, or use of conflict minerals if the supplier does not take corrective actions within a reasonable period of time.", "Repairs performed to bring a salvaged vehicle back into service may not meet Tesla standards or specifications and that is why the vehicle is unsupported.", "Until Tesla can confirm that the vehicle is in compliance with Tesla’s safety standards and vehicle specifications, Tesla does not perform or support repairs involving the HV (high-voltage) battery systems in the vehicle because of the potential for the salvage vehicle to have sustained damage that:\n\nMakes the vehicle unsafe to drive\nMakes the vehicle unsafe for any repair technicians that might work on the vehicle\nMight damage Tesla equipment, such as Superchargers\nWhen a vehicle is classified as a salvaged vehicle:\n\nAny Tesla limited warranties and extended service agreements for the vehicle are void.", "If the Tesla Service Center determines that the vehicle is not safe to repair, the recall-related repair will not be performed until the customer has returned the vehicle to a condition that the Service Center determines is safe to repair.", "For more information about this policy, please contact a Tesla Service Center."]
}, {
    "entity": "Marketing",
    "sentences": ["Sharing Your Information\nWe may share information with: \n\n(1) Our service providers and business partners when necessary to perform services on our or on your behalf \n(2) Third parties you authorize \n(3) Other third parties as required by law \n\nSome examples of when we may share your information include, payment processing, order fulfillment, product installation, customer service, marketing, financing, service or repair, and other similar services.", "Choice and Transparency\nWe enable you to access and control the data that we collect, use and share from or about you, or your use of our products or services, including through device permissions, in-app settings, marketing opt-outs, and disabling collection of certain vehicle data.", "A party is \"acting in good faith\" for so long as such party and its related or affiliated companies have not:\n\nasserted, helped others assert or had a financial stake in any assertion of (i) any patent or other intellectual property right against Tesla or (ii) any patent right against a third party for its use of technologies relating to electric vehicles or related equipment;\nchallenged, helped others challenge, or had a financial stake in any challenge to any Tesla patent; or\nmarketed or sold any knock-off product (e.g., a product created by imitating or copying the design or appearance of a Tesla product or which suggests an association with or endorsement by Tesla) or provided any material assistance to another party doing so."]
}, {
    "entity": "Finance",
    "sentences": ["Sharing Your Information\nWe may share information with: \n\n(1) Our service providers and business partners when necessary to perform services on our or on your behalf \n(2) Third parties you authorize \n(3) Other third parties as required by law \n\nSome examples of when we may share your information include, payment processing, order fulfillment, product installation, customer service, marketing, financing, service or repair, and other similar services.", "The goal of this policy is to ensure that Tesla's products do not directly or indirectly finance or benefit armed groups through mining or mineral trading in the DRC and adjoining countries.", "A party is \"acting in good faith\" for so long as such party and its related or affiliated companies have not:\n\nasserted, helped others assert or had a financial stake in any assertion of (i) any patent or other intellectual property right against Tesla or (ii) any patent right against a third party for its use of technologies relating to electric vehicles or related equipment;\nchallenged, helped others challenge, or had a financial stake in any challenge to any Tesla patent; or\nmarketed or sold any knock-off product (e.g., a product created by imitating or copying the design or appearance of a Tesla product or which suggests an association with or endorsement by Tesla) or provided any material assistance to another party doing so."]
}, {
    "entity": "Maintenance",
    "sentences": ["Sharing Your Information\nWe may share information with: \n\n(1) Our service providers and business partners when necessary to perform services on our or on your behalf \n(2) Third parties you authorize \n(3) Other third parties as required by law \n\nSome examples of when we may share your information include, payment processing, order fulfillment, product installation, customer service, marketing, financing, service or repair, and other similar services.", "In addition, neither we, any Tesla entity nor our service partners are liable (1) for our inability to contact any service partner or other party in any particular situation (including any emergency personnel), (2) for any act or omission of any other company furnishing a part of our Service or any equipment provided for such Service, (3) for errors or omissions of any vendors, dealers or manufacturers participating in offers made through us, or (4) for any damages that result from or arise out of the use, installation, repair or maintenance by you (or by any person you authorize) of the Service, or any product or service provided by or manufactured by third parties.", "Repairs performed to bring a salvaged vehicle back into service may not meet Tesla standards or specifications and that is why the vehicle is unsupported.", "Until Tesla can confirm that the vehicle is in compliance with Tesla’s safety standards and vehicle specifications, Tesla does not perform or support repairs involving the HV (high-voltage) battery systems in the vehicle because of the potential for the salvage vehicle to have sustained damage that:\n\nMakes the vehicle unsafe to drive\nMakes the vehicle unsafe for any repair technicians that might work on the vehicle\nMight damage Tesla equipment, such as Superchargers\nWhen a vehicle is classified as a salvaged vehicle:\n\nAny Tesla limited warranties and extended service agreements for the vehicle are void.", "NOTE: Repairs due to recalls will be performed unless the safe repair of the vehicle is prevented either by the condition of the vehicle or by vehicle modifications not installed by Tesla.", "If the Tesla Service Center determines that the vehicle is not safe to repair, the recall-related repair will not be performed until the customer has returned the vehicle to a condition that the Service Center determines is safe to repair.", "Termination, Suspension, Reactivation, Change and Transfer of Service\nSuspension or Termination\nWe can decide to either suspend or terminate the Service without warning, or issue a warning including for network or system maintenance, improvement, or failure or if we suspect your Service is being used for any unauthorized or inappropriate purpose, as a result of your breach of these Terms & Conditions or for reasons unrelated to you or your account with us."]
}, {
    "entity": "Utility",
    "sentences": ["Privacy\n\nCustomer Privacy Notice\n\nGet to know our Privacy Notice and your choices about how information is used.", "Choice and Transparency\nWe enable you to access and control the data that we collect, use and share from or about you, or your use of our products or services, including through device permissions, in-app settings, marketing opt-outs, and disabling collection of certain vehicle data.", "Some examples are atmospheric, geographic, or topographic conditions (such as tall buildings, hills or tunnels), damage to or failure to maintain your Vehicle or the equipment in good working order, government laws, rules or regulations, failure, congestion or outages of utility or wireless networks (including interruption of cellular service), war, act of God, natural disaster, inclement weather, and labor strikes."]
}, {
    "entity": "Transparency",
    "sentences": ["This notice is designed to provide transparency into our privacy practices, in a format that is easy to read, understand and navigate.", "Choice and Transparency\nWe enable you to access and control the data that we collect, use and share from or about you, or your use of our products or services, including through device permissions, in-app settings, marketing opt-outs, and disabling collection of certain vehicle data.", "Tesla Conflict Minerals Report\n\nDownload PDF\n\nLast Updated May 2020\n\nTesla Supplier Code of Conduct\n\nDownload PDF\n\nLast Updated June 2017\n\nTesla UK Modern Slavery Act Transparency Statement\n\nDownload 2019 Report PDF\n\nLast Updated June 2020\n\nDownload 2018 Report PDF\n\nDownload 2017 Report PDF\n\nDownload 2016 Report PDF\n\nUnsupported or Salvaged Vehicle Policy\n\nAn unsupported or salvaged vehicle is a vehicle that has been declared a total loss, commonly after extensive damage caused by a crash, flooding, fire, or similar hazard, and has been (or qualifies to be) registered and/or titled by its owner as a salvaged vehicle or its equivalent pursuant to local jurisdiction or industry practice.", "Relationship with HMRC\n\nTesla seeks to maintain an open, professional and transparent relationship with Her Majesty’s Revenue & Customs (‘HMRC’)."]
}, {
    "entity": "Hardware",
    "sentences": ["Information We May Collect\nWe collect three main types of information related to you or your use of our products and services: \n\n(1) Information from or about you or your devices \n(2) Information from or about your Tesla vehicle \n(3) Information from or about your Tesla energy products \n\nDepending on the Tesla products and services you request, own, or use, not all of these types of information may be applicable.", "Choice and Transparency\nWe enable you to access and control the data that we collect, use and share from or about you, or your use of our products or services, including through device permissions, in-app settings, marketing opt-outs, and disabling collection of certain vehicle data."]
}, {
    "entity": "Waiver",
    "sentences": ["Waiver; Severability\nNo waiver of any part of these Terms & Conditions, or of any breach of it, in any one instance will require us to waive any other instance or breach.", "In order for Tesla to preserve its ability to enforce the Tesla Patents against any party not acting in good faith, the Pledge is not a waiver of any patent claims (including claims for damages for past acts of infringement) and is not a license, covenant not to sue, or authorization to engage in patented activities or a limitation on remedies, damages or claims.", "Except as expressly stated in the Pledge, no rights shall be deemed granted, waived or received by implication, exhaustion, estoppel or otherwise.", "We will waive the idle fee if your car is moved within five minutes after it is finished charging, and the idle fee will not accumulate while less than half of the charging stalls at your location are occupied."]
}, {
    "entity": "Severability",
    "sentences": ["Waiver; Severability\nNo waiver of any part of these Terms & Conditions, or of any breach of it, in any one instance will require us to waive any other instance or breach."]
}, {
    "entity": "Security interest",
    "sentences": ["Tesla, Inc\nAttn: Legal,\n45500 Fremont Boulevard\nFremont, CA 94538\n(650) 681-5000\n\nTerms of Use\n\nPayment Terms for Services\nPremium Connectivity\nRevocation Policy\nSupercharger Fair Use Policy\nTesla Intellectual Property\nPayment Terms for Services\n\nThese Terms of Service describe your agreement to pay for future services and charges.", "The services or charges described below may result in charges to you, even if someone else is using your vehicle.", "Charges may include taxes as required by law.", "Idle Fee\n\nIn consideration of others who need to use a Supercharger, we ask that you move your vehicle when it is finished charging.", "To avoid idle fees, we recommend you monitor your vehicle while using a Supercharger and encourage you to use the Tesla mobile app to track your vehicle's charge status.", "For additional information, please see our Supercharger support page.", "Changes to Terms & Conditions\nWe can change these Terms & Conditions; change, add or delete Services or the features included therein; and change the prices we charge for the Service, at any time.", "If you do not cancel your Service prior to the applicable effective date of the changes, your Service will be modified to reflect the applicable change to prices and/or features charged for your Service.", "Payment Provisions\nThird Party Charges\nYou are responsible for paying directly to third parties all charges for services furnished by them directly to you that are not expressly covered by your Service.", "All charges will be charged in advance of the term to which they apply.", "We may terminate or suspend your Service without notice to you, if your credit, charge or debit card provider refuses a charge from us or if such card has otherwise expired.", "Even if we terminate or suspend your Service, you will still be responsible for any charges due at the time of such suspension or termination.", "If we elect to terminate your Service, you will be entitled to a pro rata refund or credit of the prepaid charges determined on the remaining monthly term of the Service.", "If we do decide to reactivate your Service, we have the right to charge a reactivation fee.", "If you fail to notify us, you will remain responsible for all charges for any Service incurred in connection with such Vehicle.", "Consequences of Revocation\n\nIf you revoke this Agreement, we shall reimburse you for all payments we have received from you, including delivery charges (except for additional charges resulting from your choosing a different method of delivery from the cheapest standard delivery offered by us), immediately and no later than fourteen days from the date we receive notification of your revocation of this Agreement.", "For this refund, we will use the same means of payment that you used for the original transaction, unless expressly agreed otherwise with you; in no case will you be charged for this refund.", "To Tesla Motors Limited, 197 Horton Road, West Drayton UB7 8JD, United Kingdom:\nHereby I/we (*) revoke the contract concluded by me/us (*) for the purchase of the following goods (*)/the provision of the following service (*)\nOrdered on (*)/received on (*) -Name of consumer(s)\nAddress of the consumer(s)\nSignature of the consumer(s) (only in the case of paper notification)\n(*) Delete as appropriate\n\n \n\nSupercharger Fair Use Policy\n\nIntroduction\n\nWe are continually expanding our global network of Supercharger stations to enable personal long distance travel and to provide a charging solution for those without immediate access to home or workplace charging, thereby accelerating the widespread adoption of electric vehicles.", "Supercharger Fair Use\n\nTo help ensure that Superchargers are available for their intended use, unless you charge on a pay per use basis, we ask that you not charge your vehicle using a Supercharger if your vehicle is being used:\n\nas a taxi;\nfor ridesourcing or ridesharing (through Uber, Lyft or similar services);\nto commercially deliver or transport goods;\nfor government purposes; or\nfor any other commercial venture.", "If you charge your vehicle in a manner that does not comply with this Supercharger Fair Use Policy, we may ask you to modify this behavior.", "We may also take additional action to protect the availability of Superchargers for their intended purpose, such as limiting or blocking your vehicle’s ability to use Supercharger stations.", "Tesla may choose to exclude certain Supercharger stations or occasional trips from the scope of this Policy, such as to accommodate specific local circumstances.", "Until Tesla can confirm that the vehicle is in compliance with Tesla’s safety standards and vehicle specifications, Tesla does not perform or support repairs involving the HV (high-voltage) battery systems in the vehicle because of the potential for the salvage vehicle to have sustained damage that:\n\nMakes the vehicle unsafe to drive\nMakes the vehicle unsafe for any repair technicians that might work on the vehicle\nMight damage Tesla equipment, such as Superchargers\nWhen a vehicle is classified as a salvaged vehicle:\n\nAny Tesla limited warranties and extended service agreements for the vehicle are void."]
}, {
    "entity": "Debit card",
    "sentences": ["We may terminate or suspend your Service without notice to you, if your credit, charge or debit card provider refuses a charge from us or if such card has otherwise expired.", "We will automatically debit your monthly payment from this credit card on the monthly anniversary of the effective date of this Agreement unless you cancel your Service before the applicable day of renewal."]
}, {
    "entity": "Tesla",
    "sentences": ["Information We May Collect\nWe collect three main types of information related to you or your use of our products and services: \n\n(1) Information from or about you or your devices \n(2) Information from or about your Tesla vehicle \n(3) Information from or about your Tesla energy products \n\nDepending on the Tesla products and services you request, own, or use, not all of these types of information may be applicable.", "Tesla Updates may be tailored to your needs and interests that we may infer from your interaction with us.", "You can withdraw your consent to receive commercial electronic messages at any time by clicking \"unsubscribe\" at the bottom of these emails or Tesla app message, or letting our customer representative know about your decision.", "Some messages directly related to a Tesla purchase cannot be opted out of.", "Tesla, Inc\nAttn: Legal,\n45500 Fremont Boulevard\nFremont, CA 94538\n(650) 681-5000\n\nTerms of Use\n\nPayment Terms for Services\nPremium Connectivity\nRevocation Policy\nSupercharger Fair Use Policy\nTesla Intellectual Property\nPayment Terms for Services\n\nThese Terms of Service describe your agreement to pay for future services and charges.", "Tesla may amend these terms and any changes are effective when posted to this page.", "Tesla may collect payment from you, including by using the credit card saved in your Tesla Account.", "You will be able to review a summary of transactions in your Tesla Account.", "To avoid idle fees, we recommend you monitor your vehicle while using a Supercharger and encourage you to use the Tesla mobile app to track your vehicle's charge status.", "We will notify you of such change by posting the amended terms on our website and/or on your Tesla Account.", "Cancellation by You\nYou may cancel the Service at any time through your Tesla Account or by contacting our Customer Support team and notifying us that you want to cancel the Service.", "Disclaimer of Warranties\nTESLA DOES NOT WARRANT OR GUARANTEE THAT SERVICE WILL BE AVAILABLE AT ANY SPECIFIC TIME OR AT ALL TIMES OR TO ANY GEOGRAPHIC LOCATION, OR THAT THE SERVICE WILL BE PROVIDED WITHOUT INTERRUPTION, DELAY OR ERROR.", "In addition, neither we, any Tesla entity nor our service partners are liable (1) for our inability to contact any service partner or other party in any particular situation (including any emergency personnel), (2) for any act or omission of any other company furnishing a part of our Service or any equipment provided for such Service, (3) for errors or omissions of any vendors, dealers or manufacturers participating in offers made through us, or (4) for any damages that result from or arise out of the use, installation, repair or maintenance by you (or by any person you authorize) of the Service, or any product or service provided by or manufactured by third parties.", "Tesla shall be liable without limitation under the Agreement for damages resulting from intentional or negligent injury to life, body or health and for other damages resulting from intentional or grossly negligent conduct by Tesla or its legal representatives or agents.", "Unless Tesla has unlimited liability under the provisions of the previous paragraph, in case of a breach of a material contractual obligation due to ordinary negligence, Tesla's liability for damages or reimbursement of expenses shall be limited to typically foreseeable damages.", "In order to exercise your right of revocation, you must inform us (Tesla Motors Limited, 197 Horton Road, West Drayton UB7 8JD, United Kingdom) by means of a clear statement (e.g.", "To Tesla Motors Limited, 197 Horton Road, West Drayton UB7 8JD, United Kingdom:\nHereby I/we (*) revoke the contract concluded by me/us (*) for the purchase of the following goods (*)/the provision of the following service (*)\nOrdered on (*)/received on (*) -Name of consumer(s)\nAddress of the consumer(s)\nSignature of the consumer(s) (only in the case of paper notification)\n(*) Delete as appropriate\n\n \n\nSupercharger Fair Use Policy\n\nIntroduction\n\nWe are continually expanding our global network of Supercharger stations to enable personal long distance travel and to provide a charging solution for those without immediate access to home or workplace charging, thereby accelerating the widespread adoption of electric vehicles.", "Tesla may choose to exclude certain Supercharger stations or occasional trips from the scope of this Policy, such as to accommodate specific local circumstances.", "For questions related to home charging, please contact charginginstallation@tesla.com.", "No Licenses\n\nTesla, Inc. strives to achieve innovative and informative internet sites.", "Tesla, Inc. hopes that you will be as enthusiastic as we are about this creative effort.", "However, Tesla, Inc. must protect its intellectual property, including its patents, trademarks and copyrights.", "Accordingly, please be on notice that neither these internet sites, nor any material contained therein shall in any way grant or be taken to grant any person a license to Tesla, Inc.'s intellectual property.", "Policy\n\nHuman Rights And Conflict Minerals Policy\n\nTesla expects our suppliers to conduct their worldwide operations in responsible manner in adherence of this policy and the principles enumerated herein.", "Tesla works collaboratively with our suppliers to encourage compliance with the following principles:\n\nLegal And Regulatory Compliance\n\nTesla suppliers are to ensure their operations and the products and services supplied to Tesla comply with all national and other applicable laws and regulations.", "Conflict Minerals\n\nTesla's suppliers are expected to use reasonable efforts to ensure that parts and products supplied to Tesla are DRC \"conflict-free,\" meaning that such conflict minerals do not benefit armed groups in the Democratic Republic of the Congo.", "The goal of this policy is to ensure that Tesla's products do not directly or indirectly finance or benefit armed groups through mining or mineral trading in the DRC and adjoining countries.", "Tesla requires its suppliers to establish policies, due diligence frameworks, and management systems, consistent with the OECD Due Diligence Guidance for Responsible Supply Chains of Minerals from Conflict-Affected and High-Risk Areas, that are designed to accomplish this goal.", "Tesla expects its suppliers to stay up-to-date with and to use validated conflict free smelters and refiners assessed by the Responsible Mineral Initiative and similar organizations.", "Human Rights\n\nTesla is committed to ensuring that its suppliers do not use slave or child labor or engage in human trafficking.", "Tesla does not, and will not, tolerate the use of slave or child labor in the manufacture of its products and does not, and will not, accept products or services from suppliers that engage in human trafficking in any form.", "Supplier Compliance\n\nTesla will do the following to ensure compliance by its suppliers with this policy as required by law and as needed:\n\nEvaluate its supply chain to address risks related to conflict minerals, human trafficking, slavery and child labor;\nAudit suppliers, to evaluate supplier compliance with Tesla's Human Rights and Conflict Minerals Policy;\nRequire direct suppliers to certify that materials incorporated into Tesla products comply with the laws regarding conflict minerals, slavery, child labor and human trafficking of the country or countries in which they are doing business;\nDiscipline employees or contractors, including potential termination of contract, who fail to meet Tesla's Human Rights and Conflict Minerals Policy;\nTrain certain Tesla employees regarding conflict minerals, human trafficking, child labor and slavery, particularly with respect to mitigating risks within the Tesla's supply chain;\nInvestigate if Tesla has a reasonable basis to believe that a Tesla supplier is engaging in human trafficking, slave or child labor, or use of conflict minerals; and\nTransition away from purchasing goods or services from any supplier that is believed to be engaging in human trafficking, slave or child labor, or use of conflict minerals if the supplier does not take corrective actions within a reasonable period of time.", "Grievance Mechanism\n\nYou may contact Tesla's Board of Directors to provide comments or to report concerns.", "You may also provide comments or report concerns by email to: legal@tesla.com.", "https://os.tesla.com/parrot-sources/parrot-sources.tar.gz\n\nAdditional packages:\n\nFor Autopilot and Infotainment system image sources, see:\nhttp://github.com/teslamotors/buildroot\n\nMain branch is buildroot-2019.02\nSee README.Tesla for more information on contents and configurations\nFor Autopilot and Infotainment kernel sources, see:\nhttp://github.com/teslamotors/linux\n\nbranches:\nintel-4.1: Infotainment Intel kernel\ntegra-2.6: Infotainment Tegra kernel\ntegra-4.4: Infotainment Tegra kernel\ntesla-3.18-hw2: Autopilot Nvidia kernel\ntesla-3.18-hw25: Autopilot Nvidia kernel\ntesla-4.14-hw3: Autopilot Tesla kernel\nFor Autopilot coreboot sources, see:\nhttp://github.com/teslamotors/coreboot\n\ntesla-4.6-hw3\nForthcoming releases and estimated timelines:\n\nHarman Radio module for Model 3\nPass-through source drop: Q3 2018\nCellular modem modules for Model S/X/3\nPass-through source drops: Q3 2018\nPatent Pledge\n\nOn June 12, 2014, Tesla announced that it will not initiate patent lawsuits against anyone who, in good faith, wants to use its technology.", "Tesla was created to accelerate the advent of sustainable transport, and this policy is intended to encourage the advancement of a common, rapidly-evolving platform for electric vehicles, thereby benefiting Tesla, other companies making electric vehicles, and the world.", "Tesla’s Pledge\n\nTesla irrevocably pledges that it will not initiate a lawsuit against any party for infringing a Tesla Patent through activity relating to electric vehicles or related equipment for so long as such party is acting in good faith.", "A list of Tesla Patents subject to the Pledge will be maintained at the following URL: https://www.tesla.com/about/legal#patent-list.", "A party is \"acting in good faith\" for so long as such party and its related or affiliated companies have not:\n\nasserted, helped others assert or had a financial stake in any assertion of (i) any patent or other intellectual property right against Tesla or (ii) any patent right against a third party for its use of technologies relating to electric vehicles or related equipment;\nchallenged, helped others challenge, or had a financial stake in any challenge to any Tesla patent; or\nmarketed or sold any knock-off product (e.g., a product created by imitating or copying the design or appearance of a Tesla product or which suggests an association with or endorsement by Tesla) or provided any material assistance to another party doing so.", "Transfer of Tesla Patents\n\nShould Tesla ever transfer a Tesla Patent to a third party, it will do so only to a party that agrees, by means of a public declaration intended to be binding on such party, to provide the same protection that Tesla provided under the Pledge and to place the same requirement on any subsequent transferee.", "In order for Tesla to preserve its ability to enforce the Tesla Patents against any party not acting in good faith, the Pledge is not a waiver of any patent claims (including claims for damages for past acts of infringement) and is not a license, covenant not to sue, or authorization to engage in patented activities or a limitation on remedies, damages or claims.", "What this pledge means is that as long as someone uses our patents for electric vehicles and doesn’t do bad things, such as knocking off our products or using our patents and then suing us for intellectual property infringement, they should have no fear of Tesla asserting its patents against them.", "Tesla Conflict Minerals Report\n\nDownload PDF\n\nLast Updated May 2020\n\nTesla Supplier Code of Conduct\n\nDownload PDF\n\nLast Updated June 2017\n\nTesla UK Modern Slavery Act Transparency Statement\n\nDownload 2019 Report PDF\n\nLast Updated June 2020\n\nDownload 2018 Report PDF\n\nDownload 2017 Report PDF\n\nDownload 2016 Report PDF\n\nUnsupported or Salvaged Vehicle Policy\n\nAn unsupported or salvaged vehicle is a vehicle that has been declared a total loss, commonly after extensive damage caused by a crash, flooding, fire, or similar hazard, and has been (or qualifies to be) registered and/or titled by its owner as a salvaged vehicle or its equivalent pursuant to local jurisdiction or industry practice.", "Tesla does not warrant the safety or operability of salvaged vehicles.", "Repairs performed to bring a salvaged vehicle back into service may not meet Tesla standards or specifications and that is why the vehicle is unsupported.", "Until Tesla can confirm that the vehicle is in compliance with Tesla’s safety standards and vehicle specifications, Tesla does not perform or support repairs involving the HV (high-voltage) battery systems in the vehicle because of the potential for the salvage vehicle to have sustained damage that:\n\nMakes the vehicle unsafe to drive\nMakes the vehicle unsafe for any repair technicians that might work on the vehicle\nMight damage Tesla equipment, such as Superchargers\nWhen a vehicle is classified as a salvaged vehicle:\n\nAny Tesla limited warranties and extended service agreements for the vehicle are void.", "NOTE: Repairs due to recalls will be performed unless the safe repair of the vehicle is prevented either by the condition of the vehicle or by vehicle modifications not installed by Tesla.", "If the Tesla Service Center determines that the vehicle is not safe to repair, the recall-related repair will not be performed until the customer has returned the vehicle to a condition that the Service Center determines is safe to repair.", "For more information about this policy, please contact a Tesla Service Center.", "Tesla’s mission is to accelerate the world’s transition to sustainable energy.", "Approach to risk management and governance in relation to UK taxation\n\nTesla is committed to being a responsible taxpayer and to comply with the tax laws and regulations in all the jurisdictions in which the Company operates, including the United Kingdom.", "Tesla is mindful of its reputation in the marketplace and aims to minimize the level of risk in relation to UK taxation.", "Tesla is not prepared to accept risk levels that expose the Company to reputational risks.", "However, given the scale of Tesla’s business and the complexity of tax legislation, it is inevitable that tax risks will arise.", "Relationship with HMRC\n\nTesla seeks to maintain an open, professional and transparent relationship with Her Majesty’s Revenue & Customs (‘HMRC’).", "In this respect, Tesla commits to make full and accurate disclosures in tax returns and in correspondence with HMRC.", "This notice is designed to provide transparency into our privacy practices, in a format that is easy to read, understand and navigate.", "How We May Use Your Information\nWe may use information we collect to: \n\n(1) Communicate with you \n(2) Fulfill our products and services \n(3) Improve and enhance development of our products and services \n\nThis includes contacting you (or other necessary parties) to advise you of important safety-related information, to notify first responders in the event of an accident involving your vehicle, present products and offers tailored to you, or to respond to your inquiries and fulfill your requests for product information, newsletters, or other events.", "Sharing Your Information\nWe may share information with: \n\n(1) Our service providers and business partners when necessary to perform services on our or on your behalf \n(2) Third parties you authorize \n(3) Other third parties as required by law \n\nSome examples of when we may share your information include, payment processing, order fulfillment, product installation, customer service, marketing, financing, service or repair, and other similar services.", "Choice and Transparency\nWe enable you to access and control the data that we collect, use and share from or about you, or your use of our products or services, including through device permissions, in-app settings, marketing opt-outs, and disabling collection of certain vehicle data.", "How to Contact Us\nFor questions or comments, to opt out from certain services, or to submit a data privacy request, please contact us.", "If we are unable to collect payment, we may contact you based on your information on file, or may request payment when we are performing services for you.", "If you do not pay past due amounts we may limit or block your vehicle's ability to use the related services until payment issues are resolved.", "Credits for Supercharging expire after a set period of time and do not rollover into future periods.", "Any change in prices for your Service or any material reduction in the features of your Service will not take effect until the next monthly period of the Service has expired.", "Payment Provisions\nThird Party Charges\nYou are responsible for paying directly to third parties all charges for services furnished by them directly to you that are not expressly covered by your Service.", "This Agreement shall have no effect on the terms and conditions of any agreement that you have entered into with a third party.", "Your Agreement to Pay\nYou are responsible for paying all amounts due on time and in full and to keep an active credit card on file with us.", "We will automatically debit your monthly payment from this credit card on the monthly anniversary of the effective date of this Agreement unless you cancel your Service before the applicable day of renewal.", "Termination, Suspension, Reactivation, Change and Transfer of Service\nSuspension or Termination\nWe can decide to either suspend or terminate the Service without warning, or issue a warning including for network or system maintenance, improvement, or failure or if we suspect your Service is being used for any unauthorized or inappropriate purpose, as a result of your breach of these Terms & Conditions or for reasons unrelated to you or your account with us.", "If we elect to terminate your Service, you will be entitled to a pro rata refund or credit of the prepaid charges determined on the remaining monthly term of the Service.", "If you cancel, your cancelation of the Service will only be effective from the end of the current monthly subscription term.", "It is your responsibility to remove all data and content (including any personal information), if any, that you may have stored on your system before you sell or transfer your Vehicle.", "Your Responsibility for Maintaining Your Vehicle\nIn order for us to provide the Service, your Vehicle must be in good working order and your Vehicle must have a working electrical system and adequate battery power.", "The Service may not work if you try to modify or add any equipment or software in or to your Vehicle that is not expressly authorized by us or is not compatible with the Service.", "Certain information you receive through the Service belongs to us (or other third parties) and may be subject to one or more copyrights, trademarks, service marks, patents, or other legal protections.", "Events Beyond Our Control\nVarious conditions beyond our control may prevent or delay us from providing Service to you, or affect the quality of the Service.", "Some examples are atmospheric, geographic, or topographic conditions (such as tall buildings, hills or tunnels), damage to or failure to maintain your Vehicle or the equipment in good working order, government laws, rules or regulations, failure, congestion or outages of utility or wireless networks (including interruption of cellular service), war, act of God, natural disaster, inclement weather, and labor strikes.", "In the event of any regulatory, governmental or other legally-compelled changes, or discontinuation or change of necessary telecommunications systems and services (e.g., if our Wireless Service Provider terminates or restricts wireless services of the type used by your Vehicle’s equipment), you are solely responsible for replacing, as well as the cost of replacing, any equipment that is necessitated as a result of such change or discontinuation, except that if such change occurs during your Vehicle’s base warranty period, while you will still be responsible for the cost of such replacement, we will be responsible for obtaining and providing you with the necessary replacement materials (if applicable).", "Such warranty does not cover the Service, in whole or in part.", "Material contractual obligations are obligations whose fulfilment is essential for the proper execution of the Agreement and on whose fulfilment you regularly rely and may rely (cardinal obligations).", "In these cases, if you experience problems or dissatisfaction with the Service, your sole and exclusive remedy is to cancel the Service and discontinue using the Service.", "We may update or modify the software contained in your Vehicle from time to time, and we may do this remotely without notifying you or seeking your consent.", "These software updates and modifications may affect or erase data that you have previously stored on the equipment in your Vehicle (such as specific route or destination information).", "We are not responsible for any lost or erased (or otherwise affected) data and you are solely responsible for the data that you may have downloaded, uploaded, transmitted or otherwise stored from, to, on or through the equipment or Service.", "You understand that software available is dependent on vehicle configuration and geographical region, which may affect your access to the Service and/or any of its features.", "Additional Terms\nGoverning Law\nThe terms of this Agreement are governed by, and to be interpreted according to, the laws of the country in which we are licensed to sell motor vehicles that is nearest to your address that you input onto our website when placing this order.", "We are not responsible for any statements, agreements, representations, warranties or covenants, oral or written, including, without limitation, any statements from third parties, concerning or relating to the Service provided to you pursuant to these Terms & Conditions, unless such statements, agreements, representations warranties or covenants are expressly contained in or incorporate by these Terms & Conditions.", "Survivorship\nEven after your Service has ended and unless it has been replaced by a new agreement expressly entered into by and between us, the provisions of these Terms & Conditions shall survive.", "Revocation Policy\n\nRight of Revocation\n\nIf you are a consumer and have concluded this Agreement exclusively by using means of remote communication (such as via the internet, telephone, e-mail or similar), you have the right to revoke this contract within fourteen days without stating reasons in accordance with the following provisions.", "a letter, fax or e-mail sent by post) of your decision to revoke this contract.", "In order to comply with the revocation period, it is sufficient to send the notification of the exercise of the right of revocation before the end of the revocation period.", "Consequences of Revocation\n\nIf you revoke this Agreement, we shall reimburse you for all payments we have received from you, including delivery charges (except for additional charges resulting from your choosing a different method of delivery from the cheapest standard delivery offered by us), immediately and no later than fourteen days from the date we receive notification of your revocation of this Agreement.", "For this refund, we will use the same means of payment that you used for the original transaction, unless expressly agreed otherwise with you; in no case will you be charged for this refund.", "Model Revocation Form\n\n(If you want to cancel the contract, please fill out this form and send it back).", "Supercharger Fair Use\n\nTo help ensure that Superchargers are available for their intended use, unless you charge on a pay per use basis, we ask that you not charge your vehicle using a Supercharger if your vehicle is being used:\n\nas a taxi;\nfor ridesourcing or ridesharing (through Uber, Lyft or similar services);\nto commercially deliver or transport goods;\nfor government purposes; or\nfor any other commercial venture.", "We may also take additional action to protect the availability of Superchargers for their intended purpose, such as limiting or blocking your vehicle’s ability to use Supercharger stations.", "Please reach out to your local sales contact to explore vehicle and charging options that suit your needs.", "Prices are current at the time of publication and subject to change without notice.", "The words \"anticipate\", \"assume\", \"believe\", \"estimate\", \"expect\", \"intend\", \"may\", \"plan\", \"project\" and \"should\" and similar expressions identify forward-looking statements.", "Such statements are subject to risks and uncertainties, including, but not limited to: changes in currency exchange rates, interest rates and in raw material prices; introduction of competing products; increased sales incentives; and decline in resale prices of used vehicles.", "Conflict-free means such parts and supplies do not contain metals derived from \"conflict minerals\" which are defined as:\n\n(i)\tcolumbite-tantalite (tantalum);\n(ii)\tcassiterite (tin);\n(iii)\tgold;\n(iv)\twolframite (tungsten); and\n(v)\tany derivatives of the above.", "Palo Alto, CA 94304\n\nYou may submit your concern anonymously or confidentially by postal mail.", "You may also indicate whether you are a shareholder, customer, supplier, or other interested party.", "Except as expressly stated in the Pledge, no rights shall be deemed granted, waived or received by implication, exhaustion, estoppel or otherwise.", "Patent list\n\nRecall\n\nClick here to check if your car is affected by a recall.", "Any Unrestricted or Over-the-Counter part may be purchased for a salvage-titled vehicle.", "A “Salvage-Titled Vehicle HV Safety Inspection” may be performed (at the customer’s expense) on the vehicle to determine if the HV-related components are safe to work on or access.", "The Company has a consistent process in place to identify, manage and mitigate exposure to issues that may have a negative impact on the business.", "To ensure that the level of risk is kept as low as possible, risk management policies and governance arrangements are in place, including controls specifically relating to tax that must be adhered to for all tax types.", "The primary tax objective of the Company is to comply with tax filing, tax reporting and tax payment obligations in the UK in order to ensure that the right amount of tax is paid at the right time.", "The Company has a low risk appetite in respect of taxation and seeks to minimize the risk of uncertainty or disputes."]
}, {
    "entity": "Negligence",
    "sentences": ["Tesla shall be liable without limitation under the Agreement for damages resulting from intentional or negligent injury to life, body or health and for other damages resulting from intentional or grossly negligent conduct by Tesla or its legal representatives or agents.", "Unless Tesla has unlimited liability under the provisions of the previous paragraph, in case of a breach of a material contractual obligation due to ordinary negligence, Tesla's liability for damages or reimbursement of expenses shall be limited to typically foreseeable damages."]
}]